{
    "catalog": [
        {
            "_id": "52991",
            "title": "Sousou no Frieren",
            "alternativeTitles": [
                "Frieren: Beyond Journey's End",
                "葬送のフリーレン"
            ],
            "ranking": 1,
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1015/138006.webp",
            "link": "https://myanimelist.net/anime/52991/Sousou_no_Frieren",
            "status": "Not yet aired",
            "synopsis": "The demon king has been defeated, and the victorious hero party returns home before disbanding. The four—mage Frieren, hero Himmel, priest Heiter, and warrior Eisen—reminisce about their decade-long journey as the moment to bid each other farewell arrives. But the passing of time is different for elves, thus Frieren witnesses her companions slowly pass away one by one.\n\nBefore his death, Heiter manages to foist a young human apprentice called Fern onto Frieren. Driven by the elf's passion for collecting a myriad of magic spells, the pair embarks on a seemingly aimless journey, revisiting the places that the heroes of yore had visited. Along their travels, Frieren slowly confronts her regrets of missed opportunities to form deeper bonds with her now-deceased comrades.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1015/138006.webp?s=dae28ee9f518202b981dedd9a9a212c3",
            "type": "TV"
        },
        {
            "_id": "5114",
            "title": "Fullmetal Alchemist: Brotherhood",
            "alternativeTitles": [
                "Hagane no Renkinjutsushi: Fullmetal Alchemist",
                "Fullmetal Alchemist (2009)",
                "FMA",
                "FMAB",
                "鋼の錬金術師 FULLMETAL ALCHEMIST",
                "Fullmetal Alchemist: Brotherhood",
                "Fullmetal Alchemist Brotherhood"
            ],
            "ranking": 2,
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy"
            ],
            "episodes": 64,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1208/94745.webp",
            "link": "https://myanimelist.net/anime/5114/Fullmetal_Alchemist__Brotherhood",
            "status": "Finished Airing",
            "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.\n\nThe brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing \"automail,\" a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.\n\nAs Edward becomes an infamous alchemist and gains the nickname \"Fullmetal,\" the boys' journey embroils them in a growing conspiracy that threatens the fate of the world.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1208/94745.webp?s=f286786e3bc43d6dc5b4478a1762224b",
            "type": "TV"
        },
        {
            "_id": "9253",
            "title": "Steins;Gate",
            "alternativeTitles": [
                "STEINS;GATE",
                "Steins;Gate"
            ],
            "ranking": 3,
            "genres": [
                "Drama",
                "Sci-Fi",
                "Suspense"
            ],
            "episodes": 24,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1935/127974.webp",
            "link": "https://myanimelist.net/anime/9253/Steins_Gate",
            "status": "Finished Airing",
            "synopsis": "Eccentric scientist Rintarou Okabe has a never-ending thirst for scientific exploration. Together with his ditzy but well-meaning friend Mayuri Shiina and his roommate Itaru Hashida, Rintarou founds the Future Gadget Laboratory in the hopes of creating technological innovations that baffle the human psyche. Despite claims of grandeur, the only notable \"gadget\" the trio have created is a microwave that has the mystifying power to turn bananas into green goo.\n\nHowever, when Rintarou decides to attend neuroscientist Kurisu Makise's conference on time travel, he experiences a series of strange events that lead him to believe that there is more to the \"Phone Microwave\" gadget than meets the eye. Apparently able to send text messages into the past using the microwave, Rintarou dabbles further with the \"time machine,\" attracting the ire and attention of the mysterious organization SERN.\n\nDue to the novel discovery, Rintarou and his friends find themselves in an ever-present danger. As he works to mitigate the damage his invention has caused to the timeline, he is not only fighting a battle to save his loved ones, but also one against his degrading sanity.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1935/127974.webp?s=983a0b526d944e68a933acca0a7db043",
            "type": "TV"
        },
        {
            "_id": "28977",
            "title": "Gintama°",
            "alternativeTitles": [
                "Gintama' (2015)",
                "銀魂°",
                "Gintama Season 4",
                "Gintama Season 4",
                "Gintama Temporada 4",
                "Gintama Saison 4"
            ],
            "ranking": 4,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 51,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/3/72078.webp",
            "link": "https://myanimelist.net/anime/28977/Gintama%C2%B0",
            "status": "Finished Airing",
            "synopsis": "Gintoki, Shinpachi, and Kagura return as the fun-loving but broke members of the Yorozuya team! Living in an alternate-reality Edo, where swords are prohibited and alien overlords have conquered Japan, they try to thrive on doing whatever work they can get their hands on. However, Shinpachi and Kagura still haven't been paid... Does Gin-chan really spend all that cash playing pachinko?\n\nMeanwhile, when Gintoki drunkenly staggers home one night, an alien spaceship crashes nearby. A fatally injured crew member emerges from the ship and gives Gintoki a strange, clock-shaped device, warning him that it is incredibly powerful and must be safeguarded. Mistaking it for his alarm clock, Gintoki proceeds to smash the device the next morning and suddenly discovers that the world outside his apartment has come to a standstill. With Kagura and Shinpachi at his side, he sets off to get the device fixed; though, as usual, nothing is ever that simple for the Yorozuya team.\n\nFilled with tongue-in-cheek humor and moments of heartfelt emotion, Gintama's fourth season finds Gintoki and his friends facing both their most hilarious misadventures and most dangerous crises yet.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/72078.webp?s=3c2861f116759641d5bffb941a86ffab",
            "type": "TV"
        },
        {
            "_id": "38524",
            "title": "Shingeki no Kyojin Season 3 Part 2",
            "alternativeTitles": [
                "進撃の巨人 Season3 Part.2",
                "Attack on Titan Season 3 Part 2",
                "Attack on Titan Staffel 3 Teil 2",
                "Ataque a los Titanes Temporada 3 Parte 2",
                "L'Attaque des Titans Saison 3 Partie 2"
            ],
            "ranking": 5,
            "genres": [
                "Action",
                "Drama"
            ],
            "episodes": 10,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1517/100633.webp",
            "link": "https://myanimelist.net/anime/38524/Shingeki_no_Kyojin_Season_3_Part_2",
            "status": "Finished Airing",
            "synopsis": "Seeking to restore humanity's diminishing hope, the Survey Corps embark on a mission to retake Wall Maria, where the battle against the merciless \"Titans\" takes the stage once again.\n\nReturning to the tattered Shiganshina District that was once his home, Eren Yeager and the Corps find the town oddly unoccupied by Titans. Even after the outer gate is plugged, they strangely encounter no opposition. The mission progresses smoothly until Armin Arlert, highly suspicious of the enemy's absence, discovers distressing signs of a potential scheme against them. \n\nShingeki no Kyojin Season 3 Part 2 follows Eren as he vows to take back everything that was once his. Alongside him, the Survey Corps strive—through countless sacrifices—to carve a path towards victory and uncover the secrets locked away in the Yeager family's basement.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1517/100633.webp?s=8ec097bf576c27c478e96097a85a6232",
            "type": "TV"
        },
        {
            "_id": "39486",
            "title": "Gintama: The Final",
            "alternativeTitles": [
                "銀魂 THE FINAL",
                "Gintama: The Very Final",
                "N/A"
            ],
            "ranking": 6,
            "genres": [
                "Action",
                "Comedy",
                "Drama",
                "Sci-Fi"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1245/116760.webp",
            "link": "https://myanimelist.net/anime/39486/Gintama__The_Final",
            "status": "Finished Airing",
            "synopsis": "Two years have passed following the Tendoshuu's invasion of the O-Edo Central Terminal. Since then, the Yorozuya have gone their separate ways. Foreseeing Utsuro's return, Gintoki Sakata begins surveying Earth's ley lines for traces of the other man's Altana. After an encounter with the remnants of the Tendoshuu—who continue to press on in search of immortality—Gintoki returns to Edo.\n\nLater, the regrouped Shinsengumi and Yorozuya begin an attack on the occupied Central Terminal. With the Altana harvested by the wreckage of the Tendoshuu's ship in danger of detonating, the Yorozuya and their allies fight their enemies while the safety of Edo—and the rest of the world—hangs in the balance. Fulfilling the wishes of their teacher, Shouyou Yoshida's former students unite and relive their pasts one final time in an attempt to save their futures.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1245/116760.webp?s=f51738ce5277b7dbc661e5afe900f684",
            "type": "Movie"
        },
        {
            "_id": "9969",
            "title": "Gintama'",
            "alternativeTitles": [
                "Gintama (2011)",
                "銀魂'",
                "Gintama Season 2",
                "Gintama Staffel 2",
                "Gintama Temporada 2",
                "Gintama Saison 2"
            ],
            "ranking": 7,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 51,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/4/50361.webp",
            "link": "https://myanimelist.net/anime/9969/Gintama",
            "status": "Finished Airing",
            "synopsis": "After a one-year hiatus, Shinpachi Shimura returns to Edo, only to stumble upon a shocking surprise: Gintoki and Kagura, his fellow Yorozuya members, have become completely different characters! Fleeing from the Yorozuya headquarters in confusion, Shinpachi finds that all the denizens of Edo have undergone impossibly extreme changes, in both appearance and personality. Most unbelievably, his sister Otae has married the Shinsengumi chief and shameless stalker Isao Kondou and is pregnant with their first child.\n\nBewildered, Shinpachi agrees to join the Shinsengumi at Otae and Kondou's request and finds even more startling transformations afoot both in and out of the ranks of the the organization. However, discovering that Vice Chief Toushirou Hijikata has remained unchanged, Shinpachi and his unlikely Shinsengumi ally set out to return the city of Edo to how they remember it.\n\nWith even more dirty jokes, tongue-in-cheek parodies, and shameless references, Gintama' follows the Yorozuya team through more of their misadventures in the vibrant, alien-filled world of Edo.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/50361.webp?s=125342fa40b162d49da3f052ea2f34b3",
            "type": "TV"
        },
        {
            "_id": "11061",
            "title": "Hunter x Hunter (2011)",
            "alternativeTitles": [
                "HxH (2011)",
                "HUNTER×HUNTER（ハンター×ハンター）",
                "Hunter x Hunter",
                "Hunter x Hunter",
                "Hunter x Hunter",
                "Hunter X Hunter"
            ],
            "ranking": 8,
            "genres": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "episodes": 148,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1337/99013.webp",
            "link": "https://myanimelist.net/anime/11061/Hunter_x_Hunter_2011",
            "status": "Finished Airing",
            "synopsis": "Hunters devote themselves to accomplishing hazardous tasks, all from traversing the world's uncharted territories to locating rare items and monsters. Before becoming a Hunter, one must pass the Hunter Examination—a high-risk selection process in which most applicants end up handicapped or worse, deceased.\n\nAmbitious participants who challenge the notorious exam carry their own reason. What drives 12-year-old Gon Freecss is finding Ging, his father and a Hunter himself. Believing that he will meet his father by becoming a Hunter, Gon takes the first step to walk the same path.\n\nDuring the Hunter Examination, Gon befriends the medical student Leorio Paladiknight, the vindictive Kurapika, and ex-assassin Killua Zoldyck. While their motives vastly differ from each other, they band together for a common goal and begin to venture into a perilous world.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1337/99013.webp?s=e05aa402158661b59d14b9da6e917559",
            "type": "TV"
        },
        {
            "_id": "820",
            "title": "Ginga Eiyuu Densetsu",
            "alternativeTitles": [
                "LoGH",
                "LotGH",
                "Gin'eiden",
                "GinEiDen",
                "Heldensagen Vom Kosmosinsel",
                "銀河英雄伝説",
                "Legend of the Galactic Heroes",
                "Les Héros de la Galaxie"
            ],
            "ranking": 9,
            "genres": [
                "Drama",
                "Sci-Fi"
            ],
            "episodes": 110,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1976/142016.webp",
            "link": "https://myanimelist.net/anime/820/Ginga_Eiyuu_Densetsu",
            "status": "Finished Airing",
            "synopsis": "The 150-year-long stalemate between the two interstellar superpowers, the Galactic Empire and the Free Planets Alliance, comes to an end when a new generation of leaders arises: the idealistic military genius Reinhard von Lohengramm, and the FPA's reserved historian, Yang Wenli.\n\nWhile Reinhard climbs the ranks of the Empire with the aid of his childhood friend, Siegfried Kircheis, he must fight not only the war, but also the remnants of the crumbling Goldenbaum Dynasty in order to free his sister from the Kaiser and unify humanity under one genuine ruler. Meanwhile, on the other side of the galaxy, Yang—a strong supporter of democratic ideals—has to stand firm in his beliefs, despite the struggles of the FPA, and show his pupil, Julian Mintz, that autocracy is not the solution.\n\nAs ideologies clash amidst the war's many casualties, the two strategic masterminds must ask themselves what the real reason behind their battle is.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1976/142016.webp?s=fab2832194d00e2598c3bc045ec5d586",
            "type": "OVA"
        },
        {
            "_id": "15417",
            "title": "Gintama': Enchousen",
            "alternativeTitles": [
                "Gintama' (2012)",
                "Gintama' Overdrive",
                "Kintama",
                "銀魂' 延長戦",
                "Gintama: Enchousen"
            ],
            "ranking": 10,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1452/123686.webp",
            "link": "https://myanimelist.net/anime/15417/Gintama__Enchousen",
            "status": "Finished Airing",
            "synopsis": "While Gintoki Sakata was away, the Yorozuya found themselves a new leader: Kintoki, Gintoki's golden-haired doppelganger. In order to regain his former position, Gintoki will need the help of those around him, a troubling feat when no one can remember him! Between Kintoki and Gintoki, who will claim the throne as the main character?\n\nIn addition, Yorozuya make a trip back down to red-light district of Yoshiwara to aid an elderly courtesan in her search for her long-lost lover. Although the district is no longer in chains beneath the earth's surface, the trio soon learn of the tragic backstories of Yoshiwara's inhabitants that still haunt them. With flashback after flashback, this quest has Yorozuya witnessing everlasting love and protecting it as best they can with their hearts and souls.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1452/123686.webp?s=bb0e9115397babdacd79295ed33cf8b2",
            "type": "TV"
        },
        {
            "_id": "57864",
            "title": "Monogatari Series: Off & Monster Season",
            "alternativeTitles": [
                "Orokamonogatari",
                "Wazamonogatari",
                "Nademonogatari",
                "Musubimonogatari",
                "Shinobumonogatari",
                "Yoimonogatari",
                "Amarimonogatari",
                "Ougimonogatari",
                "Shinomonogatari",
                "〈物語〉シリーズ オフ&モンスターシーズン"
            ],
            "ranking": 11,
            "genres": [
                "Comedy",
                "Mystery",
                "Supernatural"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1741/140952.webp",
            "link": "https://myanimelist.net/anime/57864/Monogatari_Series__Off___Monster_Season",
            "status": "Not yet aired",
            "synopsis": "After graduating from high school, the story of Koyomi Araragi came to an end. This time, it truly ended. However, the story of the girls who were saved by Araragi was not over. It is a prequel, or perhaps a sequel to their struggles in youth.\n\n(Source: MAL News)",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1741/140952.webp?s=7fb0c0c556492678e0c76d9663f90e6b",
            "type": "Unknown"
        },
        {
            "_id": "41467",
            "title": "Bleach: Sennen Kessen-hen",
            "alternativeTitles": [
                "Bleach: Thousand-Year Blood War Arc",
                "BLEACH 千年血戦篇",
                "Bleach: Thousand-Year Blood War"
            ],
            "ranking": 12,
            "genres": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1908/135431.webp",
            "link": "https://myanimelist.net/anime/41467/Bleach__Sennen_Kessen-hen",
            "status": "Finished Airing",
            "synopsis": "Substitute Soul Reaper Ichigo Kurosaki spends his days fighting against Hollows, dangerous evil spirits that threaten Karakura Town. Ichigo carries out his quest with his closest allies: Orihime Inoue, his childhood friend with a talent for healing; Yasutora Sado, his high school classmate with superhuman strength; and Uryuu Ishida, Ichigo's Quincy rival.\n\nIchigo's vigilante routine is disrupted by the sudden appearance of Asguiaro Ebern, a dangerous Arrancar who heralds the return of Yhwach, an ancient Quincy king. Yhwach seeks to reignite the historic blood feud between Soul Reaper and Quincy, and he sets his sights on erasing both the human world and the Soul Society for good.\n\nYhwach launches a two-pronged invasion into both the Soul Society and Hueco Mundo, the home of Hollows and Arrancar. In retaliation, Ichigo and his friends must fight alongside old allies and enemies alike to end Yhwach's campaign of carnage before the world itself comes to an end.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1908/135431.webp?s=6c10634de66fc83aa64471795de02461",
            "type": "TV"
        },
        {
            "_id": "43608",
            "title": "Kaguya-sama wa Kokurasetai: Ultra Romantic",
            "alternativeTitles": [
                "Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen 3rd Season",
                "Kaguya-sama: Love is War Season 3rd Season",
                "かぐや様は告らせたい-ウルトラロマンティック-",
                "Kaguya-sama: Love is War - Ultra Romantic"
            ],
            "ranking": 13,
            "genres": [
                "Comedy",
                "Romance"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1160/122627.webp",
            "link": "https://myanimelist.net/anime/43608/Kaguya-sama_wa_Kokurasetai__Ultra_Romantic",
            "status": "Finished Airing",
            "synopsis": "The elite members of Shuchiin Academy's student council continue their competitive day-to-day antics. Council president Miyuki Shirogane clashes daily against vice-president Kaguya Shinomiya, each fighting tooth and nail to trick the other into confessing their romantic love. Kaguya struggles within the strict confines of her wealthy, uptight family, rebelling against her cold default demeanor as she warms to Shirogane and the rest of her friends.\n\nMeanwhile, council treasurer Yuu Ishigami suffers under the weight of his hopeless crush on Tsubame Koyasu, a popular upperclassman who helps to instill a new confidence in him. Miko Iino, the newest student council member, grows closer to the rule-breaking Ishigami while striving to overcome her own authoritarian moral code.\n\nAs love further blooms at Shuchiin Academy, the student council officers drag their outsider friends into increasingly comedic conflicts.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1160/122627.webp?s=46750589d84c99f93ce6fec83d691766",
            "type": "TV"
        },
        {
            "_id": "34096",
            "title": "Gintama.",
            "alternativeTitles": [
                "Gintama (2017)",
                "銀魂。",
                "Gintama Season 5"
            ],
            "ranking": 14,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/3/83528.webp",
            "link": "https://myanimelist.net/anime/34096/Gintama",
            "status": "Finished Airing",
            "synopsis": "After joining the resistance against the bakufu, Gintoki and the gang are in hiding, along with Katsura and his Joui rebels. The Yorozuya is soon approached by Nobume Imai and two members of the Kiheitai, who explain that the Harusame pirates have turned against 7th Division Captain Kamui and their former ally Takasugi. The Kiheitai present Gintoki with a job: find Takasugi, who has been missing since his ship was ambushed in a Harusame raid. Nobume also makes a stunning revelation regarding the Tendoushuu, a secret organization pulling the strings of numerous factions, and their leader Utsuro, the shadowy figure with an uncanny resemblance to Gintoki's former teacher.\n\nHitching a ride on Sakamoto's space ship, the Yorozuya and Katsura set out for Rakuyou, Kagura's home planet, where the various factions have gathered and tensions are brewing. Long-held grudges, political infighting, and the Tendoushuu's sinister overarching plan finally culminate into a massive, decisive battle on Rakuyou.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/83528.webp?s=8a247bb8f07d45b8efc548760e2cb9c2",
            "type": "TV"
        },
        {
            "_id": "42938",
            "title": "Fruits Basket: The Final",
            "alternativeTitles": [
                "Fruits Basket 3rd Season",
                "Fruits Basket (2019) 3rd Season",
                "Furuba",
                "フルーツバスケット The Final",
                "Fruits Basket: The Final Season",
                "Fruits Basket Staffel 3",
                "Fruits Basket: The Final Season",
                "Fruits Basket Saison 3"
            ],
            "ranking": 15,
            "genres": [
                "Drama",
                "Romance",
                "Supernatural"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1085/114792.webp",
            "link": "https://myanimelist.net/anime/42938/Fruits_Basket__The_Final",
            "status": "Finished Airing",
            "synopsis": "Hundreds of years ago, the Chinese Zodiac spirits and their god swore to stay together eternally. United by this promise, the possessed members of the Souma family shall always return to each other under any circumstances. Yet, when these bonds shackle them from freedom, it becomes an undesirable burden—a curse. As head of the clan, Akito is convinced that he shares a special connection with the other Soumas. While he desperately clings to this fantasy, the rest of the family remains isolated and suppressed by the fear of punishment.\n\nTooru Honda, who has grown attached to the Soumas, is determined to break the chains that bind them. Her companionship with the family and her friends encourages her to move forward with lifting the curse. However, due to confounding revelations, she struggles to find the tenacity to continue her endeavors. With time slowly withering away, Tooru contends with an uncertain future in hopes of reaching the tranquility that may lie beyond all this commotion.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1085/114792.webp?s=04165789c1231f242d2febdee81a89ec",
            "type": "TV"
        },
        {
            "_id": "4181",
            "title": "Clannad: After Story",
            "alternativeTitles": [
                "CLANNAD〜AFTER STORY〜 クラナド アフターストーリー",
                "Clannad: After Story",
                "Clannad ~After Story~",
                "Clannad ~After Story~",
                "Clannad ~After Story~"
            ],
            "ranking": 16,
            "genres": [
                "Drama",
                "Romance",
                "Supernatural"
            ],
            "episodes": 24,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1299/110774.webp",
            "link": "https://myanimelist.net/anime/4181/Clannad__After_Story",
            "status": "Finished Airing",
            "synopsis": "Clannad: After Story, the sequel to the critically acclaimed slice-of-life series Clannad, begins after Tomoya Okazaki and Nagisa Furukawa graduate from high school. Together, they experience the emotional rollercoaster of growing up. Unable to decide on a course for his future, Tomoya learns the value of a strong work ethic and discovers the strength of Nagisa's support. Through the couple's dedication and unity of purpose, they push forward to confront their personal problems, deepen their old relationships, and create new bonds.\n\nTime also moves on in the Illusionary World. As the plains grow cold with the approach of winter, the Illusionary Girl and the Garbage Doll are presented with a difficult situation that reveals the World's true purpose.\n\nBased on the visual novel by Key and produced by Kyoto Animation, Clannad: After Story is an impactful drama highlighting the importance of family and the struggles of adulthood.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1299/110774.webp?s=c382e27b55d7143876f03ad5f9d7595c",
            "type": "TV"
        },
        {
            "_id": "918",
            "title": "Gintama",
            "alternativeTitles": [
                "Gin Tama",
                "Silver Soul",
                "Yorinuki Gintama-san",
                "銀魂",
                "Gintama"
            ],
            "ranking": 17,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 201,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/10/73274.webp",
            "link": "https://myanimelist.net/anime/918/Gintama",
            "status": "Finished Airing",
            "synopsis": "Edo is a city that was home to the vigor and ambition of samurai across the country. However, following feudal Japan's surrender to powerful aliens known as the \"Amanto,\" those aspirations now seem unachievable. With the once-influential shogunate rebuilt as a puppet government, a new law is passed that promptly prohibits all swords in public. \n\nEnter Gintoki Sakata, an eccentric silver-haired man who always carries around a wooden sword and maintains his stature as a samurai despite the ban. As the founder of Yorozuya, a small business for odd jobs, Gintoki often embarks on endeavors to help other people—though usually in rather strange and unforeseen ways. \n\nAssisted by Shinpachi Shimura, a boy with glasses supposedly learning the way of the samurai; Kagura, a tomboyish girl with superhuman strength and an endless appetite; and Sadaharu, their giant pet dog who loves biting on people's heads, the Yorozuya encounter anything from alien royalty to scuffles with local gangs in the ever-changing world of Edo.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/73274.webp?s=125ecd96527f4a1806c42c82fe672f3b",
            "type": "TV"
        },
        {
            "_id": "28851",
            "title": "Koe no Katachi",
            "alternativeTitles": [
                "The Shape of Voice",
                "聲の形",
                "A Silent Voice",
                "A Silent Voice",
                "Una Voz Silenciosa",
                "A Silent Voice"
            ],
            "ranking": 18,
            "genres": [
                "Award Winning",
                "Drama"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1122/96435.webp",
            "link": "https://myanimelist.net/anime/28851/Koe_no_Katachi",
            "status": "Finished Airing",
            "synopsis": "As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye.\n\nNow in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends.\n\nKoe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past.\n \n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1122/96435.webp?s=959086d78ba36bab65797eb07396d985",
            "type": "Movie"
        },
        {
            "_id": "35180",
            "title": "3-gatsu no Lion 2nd Season",
            "alternativeTitles": [
                "Sangatsu no Lion Second Season",
                "3月のライオン 第2シリーズ",
                "March Comes In Like A Lion 2nd Season",
                "March Come in Like a Lion Staffel 2",
                "March Comes in like a Lion Temporada 2",
                "March Comes in like a Lion Saison 2"
            ],
            "ranking": 19,
            "genres": [],
            "episodes": 22,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/3/88469.webp",
            "link": "https://myanimelist.net/anime/35180/3-gatsu_no_Lion_2nd_Season",
            "status": "Finished Airing",
            "synopsis": "Now in his second year of high school, Rei Kiriyama continues pushing through his struggles in the professional shogi world as well as his personal life. Surrounded by vibrant personalities at the shogi hall, the school club, and in the local community, his solitary shell slowly begins to crack. Among them are the three Kawamoto sisters—Akari, Hinata, and Momo—who forge an affectionate and familial bond with Rei. Through these ties, he realizes that everyone is burdened by their own emotional hardships and begins learning how to rely on others while supporting them in return. \n\nNonetheless, the life of a professional is not easy. Between tournaments, championships, and title matches, the pressure mounts as Rei advances through the ranks and encounters incredibly skilled opponents. As he manages his relationships with those who have grown close to him, the shogi player continues to search for the reason he plays the game that defines his career.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/88469.webp?s=1582d226f6c7cfb8bb4e94f72528e421",
            "type": "TV"
        },
        {
            "_id": "2904",
            "title": "Code Geass: Hangyaku no Lelouch R2",
            "alternativeTitles": [
                "Code Geass: Hangyaku no Lelouch 2nd Season",
                "Code Geass: Hangyaku no Lelouch Second Season",
                "コードギアス 反逆のルルーシュ 続編",
                "Code Geass: Lelouch of the Rebellion R2",
                "Code Geass: Lelouch of the Rebellion R2",
                "Code Geass: Lelouch",
                "el de la Rebelión R2",
                "Code Geass: Lelouch of the Rebellion R2"
            ],
            "ranking": 20,
            "genres": [
                "Action",
                "Award Winning",
                "Drama",
                "Sci-Fi"
            ],
            "episodes": 25,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1088/135089.webp",
            "link": "https://myanimelist.net/anime/2904/Code_Geass__Hangyaku_no_Lelouch_R2",
            "status": "Finished Airing",
            "synopsis": "One year has passed since the Black Rebellion, a failed uprising against the Holy Britannian Empire led by the masked vigilante Zero, who is now missing. At a loss without their revolutionary leader, Area 11's resistance group—the Black Knights—find themselves too powerless to combat the brutality inflicted upon the Elevens by Britannia, which has increased significantly in order to crush any hope of a future revolt. \n\nLelouch Lamperouge, having lost all memory of his double life, is living peacefully alongside his friends as a high school student at Ashford Academy. His former partner C.C., unable to accept this turn of events, takes it upon herself to remind him of his past purpose, hoping that the mastermind Zero will rise once again to finish what he started, in this thrilling conclusion to the series.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1088/135089.webp?s=7febb58b502ad4d1829f2462eda4e091",
            "type": "TV"
        },
        {
            "_id": "15335",
            "title": "Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare",
            "alternativeTitles": [
                "Gintama: The Final Chapter - Be Forever Yorozuya",
                "Gintama Movie 2",
                "劇場版 銀魂 完結篇 万事屋よ永遠なれ",
                "Gintama: The Movie: The Final Chapter: Be Forever Yorozuya",
                "Gintama the Movie 2"
            ],
            "ranking": 21,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/10/51723.webp",
            "link": "https://myanimelist.net/anime/15335/Gintama_Movie_2__Kanketsu-hen_-_Yorozuya_yo_Eien_Nare",
            "status": "Finished Airing",
            "synopsis": "When Gintoki apprehends a movie pirate at a premiere, he checks the camera's footage and finds himself transported to a bleak, post-apocalyptic version of Edo, where a mysterious epidemic called the \"White Plague\" has ravished the world's population. It turns out that the movie pirate wasn't a pirate after all—it was an android time machine, and Gintoki has been hurtled five years into the future! Shinpachi and Kagura, his Yorozuya cohorts, have had a falling out and are now battle-hardened solo vigilantes and he himself has been missing for years, disappearing without a trace after scribbling a strange message in his journal.\n\nSetting out in the disguise given to him by the android time machine, Gintoki haphazardly reunites the Yorozuya team to investigate the White Plague, and soon discovers that the key to saving the future lies in the darkness of his own past. Determined to confront a powerful foe, he makes an important discovery—with a ragtag band of friends and allies at his side, he doesn't have to fight alone.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/51723.webp?s=b5631a4182ad47db470c9a14b3a830be",
            "type": "Movie"
        },
        {
            "_id": "54492",
            "title": "Kusuriya no Hitorigoto",
            "alternativeTitles": [
                "Drugstore Soliloquy",
                "薬屋のひとりごと",
                "The Apothecary Diaries"
            ],
            "ranking": 22,
            "genres": [
                "Drama",
                "Mystery"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1708/138033.webp",
            "link": "https://myanimelist.net/anime/54492/Kusuriya_no_Hitorigoto",
            "status": "Not yet aired",
            "synopsis": "In an imperial court in ancient China, it has been a few months since a 17-year-old girl known as Maomao was kidnapped and forced to work as a low-level servant at the emperor's palace. Still, she manages to retain her curious and pragmatic spirit, planning to work until her years of servitude are over. One day, however, she catches wind of the fact that the emperor's two infants have fallen gravely ill. She decides to secretly take action, drawing on her experience as a pharmacist raised in the poor red-light district.\n\nDespite Maomao's attempts to remain anonymous, she soon catches the eye of Jinshi, an influential eunuch who recognizes her talents. Maomao soon finds herself in the emperor's inner court, where she gradually makes a name for herself by utilizing her knowledge and eccentric personality to solve various medical mysteries.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1708/138033.webp?s=b5f26a953db1e9c4aac5f2c1499f03f6",
            "type": "TV"
        },
        {
            "_id": "19",
            "title": "Monster",
            "alternativeTitles": [
                "モンスター",
                "Monster"
            ],
            "ranking": 23,
            "genres": [
                "Drama",
                "Mystery",
                "Suspense"
            ],
            "episodes": 74,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/10/18793.webp",
            "link": "https://myanimelist.net/anime/19/Monster",
            "status": "Finished Airing",
            "synopsis": "Dr. Kenzou Tenma, an elite neurosurgeon recently engaged to his hospital director's daughter, is well on his way to ascending the hospital hierarchy. That is until one night, a seemingly small event changes Dr. Tenma's life forever. While preparing to perform surgery on someone, he gets a call from the hospital director telling him to switch patients and instead perform life-saving brain surgery on a famous performer. His fellow doctors, fiancée, and the hospital director applaud his accomplishment; but because of the switch, a poor immigrant worker is dead, causing Dr. Tenma to have a crisis of conscience.\n\nSo when a similar situation arises, Dr. Tenma stands his ground and chooses to perform surgery on the young boy Johan Liebert instead of the town's mayor. Unfortunately, this choice leads to serious ramifications for Dr. Tenma—losing his social standing being one of them. However, with the mysterious death of the director and two other doctors, Dr. Tenma's position is restored. With no evidence to convict him, he is released and goes on to attain the position of hospital director. \n\nNine years later when Dr. Tenma saves the life of a criminal, his past comes back to haunt him—once again, he comes face to face with the monster he operated on. He must now embark on a quest of pursuit to make amends for the havoc spread by the one he saved.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/18793.webp?s=a74f8cede86b7b26248ba0b3846f9dcd",
            "type": "TV"
        },
        {
            "_id": "37491",
            "title": "Gintama.: Shirogane no Tamashii-hen - Kouhan-sen",
            "alternativeTitles": [
                "Gintama.: Silver Soul Arc 2",
                "銀魂. 銀ノ魂篇 後半戦",
                "Gintama.: Silver Soul Arc - Second Half War"
            ],
            "ranking": 24,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 14,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1776/96566.webp",
            "link": "https://myanimelist.net/anime/37491/Gintama__Shirogane_no_Tamashii-hen_-_Kouhan-sen",
            "status": "Finished Airing",
            "synopsis": "Following the temporary retreat of the Altana Liberation Army from the Kabuki District, the state of the war has seemingly improved. However, as the Oniwaban, Shinsengumi, and residents of the district combat the army's remnants, Edo's greatest inventor Gengai Hiraga is abducted. Responsible for causing the enemy's withdrawal by rendering their weapons useless, Gengai's nanomachine virus is now at risk of being shut down.\n\nMeanwhile, a laser capable of obliterating a planet is activated in Earth's orbit on the Liberation Army's mother ship. Another battle ensues when Shinsuke Takasugi and the rest of the Kiheitai arrive on the vessel to stop the weapon from firing. Forced to fight a war on two fronts, the Yorozuya and their allies must prevail on both sides to save Edo and the rest of the world.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1776/96566.webp?s=ca41369c775a73ebf740fe6c817f1d12",
            "type": "TV"
        },
        {
            "_id": "51535",
            "title": "Shingeki no Kyojin: The Final Season - Kanketsu-hen",
            "alternativeTitles": [
                "Shingeki no Kyojin: The Final Season Part 3",
                "Shingeki no Kyojin Season 4",
                "Attack on Titan Season 4",
                "進撃の巨人 The Final Season完結編",
                "Attack on Titan: The Final Season - Final Chapters"
            ],
            "ranking": 25,
            "genres": [
                "Action",
                "Drama",
                "Suspense"
            ],
            "episodes": 2,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1279/131078.webp",
            "link": "https://myanimelist.net/anime/51535/Shingeki_no_Kyojin__The_Final_Season_-_Kanketsu-hen",
            "status": "Currently Airing",
            "synopsis": "In the wake of Eren Yeager's cataclysmic actions, his friends and former enemies form an alliance against his genocidal rampage. Though once bitter foes, Armin Arlert, Mikasa Ackerman, and the remaining members of the Scout Regiment join forces with Reiner Braun and the survivors of the Marleyan military. Their meager united front sets out on a mission to stop Eren's wrath and—if possible—save their old comrade in the process.\n\nAs Eren pushes forward at any cost, he battles his own internal turmoil. Although he feels immense remorse over his horrific invasion, Eren believes he harbors noble intentions: he believes the path ahead is the only way to save his friends and, to a greater extent, his people.\n\nThe opposing battalions spiral toward an inevitable final clash that may claim the lives of millions. Though they face an army of monsters beyond anything they could have previously imagined, Mikasa, Armin, and their allies stand brave in the face of certain doom.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1279/131078.webp?s=3651cb648c9f6defdb8a1f90ce43ed96",
            "type": "Special"
        },
        {
            "_id": "35247",
            "title": "Owarimonogatari 2nd Season",
            "alternativeTitles": [
                "End Story 2nd Season",
                "終物語",
                "Owarimonogatari Second Season",
                "Owarimonogatari Saison 2"
            ],
            "ranking": 26,
            "genres": [
                "Comedy",
                "Mystery",
                "Supernatural"
            ],
            "episodes": 7,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/6/87322.webp",
            "link": "https://myanimelist.net/anime/35247/Owarimonogatari_2nd_Season",
            "status": "Finished Airing",
            "synopsis": "Following an encounter with oddity specialist Izuko Gaen, third-year high school student Koyomi Araragi wakes up in a strange, deserted void only to be greeted by a joyfully familiar face in an alarmingly unfamiliar place.  \n\nAraragi, with the help of his girlfriend Hitagi Senjougahara, maneuvers through the webs of his past and the perplexities of the present in search of answers. However, fate once again delivers him to the eccentric transfer student Ougi Oshino, who brings forth an unexpected proposal that may unearth the very foundation to which he is anchored. As Araragi peels back the layers of mystery surrounding an apparition, he discovers a truth not meant to be revealed.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/87322.webp?s=ab248a94549779d70ee098afd29e1811",
            "type": "TV"
        },
        {
            "_id": "37987",
            "title": "Violet Evergarden Movie",
            "alternativeTitles": [
                "Gekijouban Violet Evergarden",
                "劇場版 ヴァイオレット・エヴァーガーデン",
                "Violet Evergarden: The Movie",
                "Violet Evergarden: La película",
                "Violet Evergarden: Le film"
            ],
            "ranking": 27,
            "genres": [
                "Award Winning",
                "Drama",
                "Fantasy"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1825/110716.webp",
            "link": "https://myanimelist.net/anime/37987/Violet_Evergarden_Movie",
            "status": "Finished Airing",
            "synopsis": "Several years have passed since the end of The Great War. As the radio tower in Leidenschaftlich continues to be built, telephones will soon become more relevant, leading to a decline in demand for \"Auto Memory Dolls.\" Even so, Violet Evergarden continues to rise in fame after her constant success with writing letters. However, sometimes the one thing you long for is the one thing that does not appear.\n\nViolet Evergarden Movie follows Violet as she continues to comprehend the concept of emotion and the meaning of love. At the same time, she pursues a glimmer of hope that the man who once told her, \"I love you,\" may still be alive even after the many years that have passed.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1825/110716.webp?s=b31af60937f54159c6436bada7fe3173",
            "type": "Movie"
        },
        {
            "_id": "32281",
            "title": "Kimi no Na wa.",
            "alternativeTitles": [
                "君の名は。",
                "Your Name.",
                "Your Name.",
                "Your Name.",
                "Your Name."
            ],
            "ranking": 28,
            "genres": [
                "Award Winning",
                "Drama",
                "Supernatural"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/5/87048.webp",
            "link": "https://myanimelist.net/anime/32281/Kimi_no_Na_wa",
            "status": "Finished Airing",
            "synopsis": "Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture.\n\nOne day, Mitsuha awakens in a room that is not her own and suddenly finds herself living the dream life in Tokyo—but in Taki's body! Elsewhere, Taki finds himself living Mitsuha's life in the humble countryside. In pursuit of an answer to this strange phenomenon, they begin to search for one another.\n\nKimi no Na wa. revolves around Mitsuha and Taki's actions, which begin to have a dramatic impact on each other's lives, weaving them into a fabric held together by fate and circumstance.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/5/87048.webp?s=14812900d1190a4ddd52031dd1e10be5",
            "type": "Movie"
        },
        {
            "_id": "40682",
            "title": "Kingdom 3rd Season",
            "alternativeTitles": [
                "キングダム 第3シリーズ",
                "Kingdom: Season 3"
            ],
            "ranking": 29,
            "genres": [],
            "episodes": 26,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1443/111830.webp",
            "link": "https://myanimelist.net/anime/40682/Kingdom_3rd_Season",
            "status": "Finished Airing",
            "synopsis": "Following the successful Sanyou campaign, the Qin army, including 1,000-Man Commander Xin, inches ever closer to fulfilling King Ying Zheng's dream of unifying China. With a major geographical foothold in the state of Wei now under its control, Qin sets its sights eastward toward the remaining warring states.\n\nMeanwhile Li Mu—an unparalleled strategist and the newly appointed prime minister of the state of Zhao—has taken advantage of Zhao's temporary truce with Qin to negotiate with the other states without interruption. Seemingly without warning, Ying Zheng receives news that armies from the states of Chu, Zhao, Wei, Han, Yan, and Qi have crossed into Qin territory. Realizing too late the purpose behind Li Mu's truce with Qin, Zheng quickly gathers his advisors to devise a plan to address the six-state coalition army on their doorstep. For the first time in history, the state of Qin faces complete destruction and must use every resource and strategy at their disposal to prevent themselves from being wiped off the map.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1443/111830.webp?s=6a5eb927961c4eca89f47fc994b8ec57",
            "type": "TV"
        },
        {
            "_id": "49387",
            "title": "Vinland Saga Season 2",
            "alternativeTitles": [
                "ヴィンランド・サガ SEASON2",
                "Vinland Saga Season 2"
            ],
            "ranking": 30,
            "genres": [
                "Action",
                "Adventure",
                "Drama"
            ],
            "episodes": 24,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1170/124312.webp",
            "link": "https://myanimelist.net/anime/49387/Vinland_Saga_Season_2",
            "status": "Finished Airing",
            "synopsis": "After his father's death and the destruction of his village at the hands of English raiders, Einar wishes for a peaceful life with his family on their newly rebuilt farms. However, fate has other plans: his village is invaded once again. Einar watches helplessly as the marauding Danes burn his lands and slaughter his family. The invaders capture Einar and take him back to Denmark as a slave. \n\nEinar clings to his mother's final words to survive. He is purchased by Ketil, a kind slave owner and landlord who promises that Einar can regain his freedom in return for working in the fields. Soon, Einar encounters his new partner in farm cultivation—Thorfinn, a dejected and melancholic slave. As Einar and Thorfinn work together toward their freedom, they are haunted by both sins of the past and the ploys of the present. Yet they carry on, grasping for a glimmer of hope, redemption, and peace in a world that is nothing but unjust and unforgiving.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1170/124312.webp?s=5c436e3f45808ea30b4c0a3be82409f5",
            "type": "TV"
        },
        {
            "_id": "55690",
            "title": "Boku no Kokoro no Yabai Yatsu 2nd Season",
            "alternativeTitles": [
                "Bokuyaba",
                "僕の心のヤバイやつ",
                "The Dangers in My Heart 2nd Season"
            ],
            "ranking": 31,
            "genres": [
                "Comedy",
                "Romance"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1643/138581.webp",
            "link": "https://myanimelist.net/anime/55690/Boku_no_Kokoro_no_Yabai_Yatsu_2nd_Season",
            "status": "Not yet aired",
            "synopsis": "Second season of Boku no Kokoro no Yabai Yatsu.",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1643/138581.webp?s=ea2173da3058f265bf97804db23c5a62",
            "type": "TV"
        },
        {
            "_id": "36838",
            "title": "Gintama.: Shirogane no Tamashii-hen",
            "alternativeTitles": [
                "銀魂. 銀ノ魂篇",
                "Gintama.: Silver Soul Arc"
            ],
            "ranking": 32,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/12/89603.webp",
            "link": "https://myanimelist.net/anime/36838/Gintama__Shirogane_no_Tamashii-hen",
            "status": "Finished Airing",
            "synopsis": "After the fierce battle on Rakuyou, the untold past and true goal of the immortal Naraku leader, Utsuro, are finally revealed. By corrupting the Altana reserves of several planets, Utsuro has successfully triggered the intervention of the Tendoshuu’s greatest enemy: the Altana Liberation Army. With Earth as the main battleground in this interplanetary war, Utsuro's master plan to destroy the planet—and himself—is nearly complete. \n\nAn attack on the O-Edo Central Terminal marks the beginning of the final battle to take back the land of the samurai. With the Yorozuya nowhere in sight, the bakufu all but collapsed, and the Shogun missing, the people are left completely helpless as the Liberation Army begins pillaging Edo in the name of freeing them from the Tendoshuu's rule. \n\nCaught in the crossfire between two equally imposing forces, can Gintoki, Kagura, Shinpachi, and the former students of Shouyou Yoshida put aside their differences and unite their allies to protect what they hold dear?\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/12/89603.webp?s=5a1c68d26254026568a10e2e4f806457",
            "type": "TV"
        },
        {
            "_id": "51009",
            "title": "Jujutsu Kaisen 2nd Season",
            "alternativeTitles": [
                "Sorcery Fight",
                "JJK",
                "呪術廻戦"
            ],
            "ranking": 33,
            "genres": [
                "Action",
                "Fantasy"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1792/138022.webp",
            "link": "https://myanimelist.net/anime/51009/Jujutsu_Kaisen_2nd_Season",
            "status": "Not yet aired",
            "synopsis": "Second season of Jujutsu Kaisen.",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1792/138022.webp?s=c813c2b655e80385dfb4ff521e973952",
            "type": "TV"
        },
        {
            "_id": "37510",
            "title": "Mob Psycho 100 II",
            "alternativeTitles": [
                "Mob Psycho 100 2nd Season",
                "Mob Psycho Hyaku",
                "Mob Psycho One Hundred",
                "モブサイコ100 II",
                "Mob Psycho 100 II"
            ],
            "ranking": 34,
            "genres": [
                "Action",
                "Comedy",
                "Supernatural"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1918/96303.webp",
            "link": "https://myanimelist.net/anime/37510/Mob_Psycho_100_II",
            "status": "Finished Airing",
            "synopsis": "Shigeo \"Mob\" Kageyama is now maturing and understanding his role as a supernatural psychic that has the power to drastically affect the livelihood of others. He and his mentor Reigen Arataka continue to deal with supernatural requests from clients, whether it be exorcizing evil spirits or tackling urban legends that haunt the citizens.\n\nWhile the workflow remains the same, Mob isn't just blindly following Reigen around anymore. With all his experiences as a ridiculously strong psychic, Mob's supernatural adventures now have more weight to them. Things take on a serious and darker tone as the dangers Mob and Reigen face are much more tangible and unsettling than ever before.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1918/96303.webp?s=c22fd2b43ecd8d6aefc006f8926550ec",
            "type": "TV"
        },
        {
            "_id": "31758",
            "title": "Kizumonogatari III: Reiketsu-hen",
            "alternativeTitles": [
                "Koyomi Vamp",
                "傷物語〈Ⅲ冷血篇〉",
                "Kizumonogatari Part 3: Cold-Blooded",
                "Kizumonogatari III: Reiketsuhen",
                "Kizumonogatari Partie 3: Sang Glacial"
            ],
            "ranking": 35,
            "genres": [
                "Action",
                "Mystery",
                "Supernatural"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1084/112813.webp",
            "link": "https://myanimelist.net/anime/31758/Kizumonogatari_III__Reiketsu-hen",
            "status": "Finished Airing",
            "synopsis": "After helping revive the legendary vampire Kiss-shot Acerola-orion Heart-under-blade, Koyomi Araragi has become a vampire himself and her servant. Kiss-shot is certain she can turn him back into a human, but only once regaining her full power. \n\nAraragi has hunted down the three vampire hunters that defeated Kiss-shot and retrieved her limbs to return her to full strength. However, now that Araragi has almost accomplished what he’s been fighting for this whole time, he has to consider if this is what he really wants. Once he revives this powerful immortal vampire, there is no telling what she might do, and there would be no way of stopping her.\n\nBut there is more to the story that Araragi doesn’t understand. If a newborn vampire like him could defeat the hunters, how did they overpower Kiss-shot? Can he trust her to turn him back to a human? And how is that even possible in the first place?\n\nAraragi is at his limit but he must come to a decision, and it may not be possible to resolve this situation without doing something he’ll regret…\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1084/112813.webp?s=52704c297de0eb606338713e4b074f08",
            "type": "Movie"
        },
        {
            "_id": "40028",
            "title": "Shingeki no Kyojin: The Final Season",
            "alternativeTitles": [
                "Shingeki no Kyojin Season 4",
                "Attack on Titan Season 4",
                "進撃の巨人 The Final Season",
                "Attack on Titan: Final Season",
                "Attack on Titan Final Season",
                "Ataque a los Titanes Temporada Final",
                "L'Attaque des Titans Saison Finale"
            ],
            "ranking": 36,
            "genres": [
                "Action",
                "Drama"
            ],
            "episodes": 16,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1000/110531.webp",
            "link": "https://myanimelist.net/anime/40028/Shingeki_no_Kyojin__The_Final_Season",
            "status": "Finished Airing",
            "synopsis": "Gabi Braun and Falco Grice have been training their entire lives to inherit one of the seven Titans under Marley's control and aid their nation in eradicating the Eldians on Paradis. However, just as all seems well for the two cadets, their peace is suddenly shaken by the arrival of Eren Yeager and the remaining members of the Survey Corps.\n\nHaving finally reached the Yeager family basement and learned about the dark history surrounding the Titans, the Survey Corps has at long last found the answer they so desperately fought to uncover. With the truth now in their hands, the group set out for the world beyond the walls.\n\nIn Shingeki no Kyojin: The Final Season, two utterly different worlds collide as each party pursues its own agenda in the long-awaited conclusion to Paradis' fight for freedom.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1000/110531.webp?s=cc9eb3ae70821928b0607c73674ab65c",
            "type": "TV"
        },
        {
            "_id": "47917",
            "title": "Bocchi the Rock!",
            "alternativeTitles": [
                "ぼっち・ざ・ろっく！",
                "Bocchi the Rock!"
            ],
            "ranking": 37,
            "genres": [],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1448/127956.webp",
            "link": "https://myanimelist.net/anime/47917/Bocchi_the_Rock",
            "status": "Finished Airing",
            "synopsis": "Yearning to make friends and perform live with a band, lonely and socially anxious Hitori \"Bocchi\" Gotou devotes her time to playing the guitar. On a fateful day, Bocchi meets the outgoing drummer Nijika Ijichi, who invites her to join Kessoku Band when their guitarist, Ikuyo Kita, flees before their first show. Soon after, Bocchi meets her final bandmate—the cool bassist Ryou Yamada. \n\nAlthough their first performance together is subpar, the girls feel empowered by their shared love for music, and they are soon rejoined by Kita. Finding happiness in performing, Bocchi and her bandmates put their hearts into improving as musicians while making the most of their fleeting high school days.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1448/127956.webp?s=5aedb25ef404ccfafa06af8ad7565fbd",
            "type": "TV"
        },
        {
            "_id": "32935",
            "title": "Haikyuu!! Karasuno Koukou vs. Shiratorizawa Gakuen Koukou",
            "alternativeTitles": [
                "Haikyuu!! Third Season",
                "Haikyuu!! Karasuno High VS Shiratorizawa Academy",
                "ハイキュー!! 烏野高校 VS 白鳥沢学園高校",
                "Haikyu!! 3rd Season",
                "Haikyuu!!Staffel 3 Karasuno vs. Shiratorizawa",
                "Haikyu!! Los Ases del Vóley Temporada 3",
                "Haikyuu!! Saison 3"
            ],
            "ranking": 38,
            "genres": [],
            "episodes": 10,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/7/81992.webp",
            "link": "https://myanimelist.net/anime/32935/Haikyuu_Karasuno_Koukou_vs_Shiratorizawa_Gakuen_Koukou",
            "status": "Finished Airing",
            "synopsis": "After the victory against Aoba Jousai High, Karasuno High School, once called “a fallen powerhouse, a crow that can’t fly,” has finally reached the climax of the heated Spring tournament. Now, to advance to nationals, the Karasuno team has to defeat the powerhouse Shiratorizawa Academy. Karasuno’s greatest hurdle is their adversary’s ace, Wakatoshi Ushijima, the number one player in the Miyagi Prefecture, and one of the country’s top three aces.\n\nOnly the strongest team will make it to the national tournament. Since this match is the third-year players’ last chance to qualify for nationals, Karasuno has to use everything they learned during the training camp and prior matches to attain victory. Filled with restlessness and excitement, both teams are determined to come out on top in the third season of Haikyuu!!.\n\n[Written by MAL Rewrite] ",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/7/81992.webp?s=61d6e8991034b0caae1afa744a885f2f",
            "type": "TV"
        },
        {
            "_id": "263",
            "title": "Hajime no Ippo",
            "alternativeTitles": [
                "The First Step",
                "Hajime no Ippo: The Fighting",
                "はじめの一歩 THE FIGHTING!",
                "Fighting Spirit",
                "Hajime no Ippo: Espíritu de Lucha",
                "IPPO Le Challenger"
            ],
            "ranking": 39,
            "genres": [],
            "episodes": 75,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/4/86334.webp",
            "link": "https://myanimelist.net/anime/263/Hajime_no_Ippo",
            "status": "Finished Airing",
            "synopsis": "In his father's absence, teenager Ippo Makunouchi works hard to help his mother run her fishing boat rental business. Ippo's timid nature, his lack of sleep, and the sea smell make him an easy target for relentless bullies who leave him bruised and beaten on a daily basis. Mamoru Takamura, an up-and-coming boxer, rescues Ippo from a violent after-school incident and takes him back to the Kamogawa Boxing Gym for recovery. Takamura and his fellow boxers, Masaru Aoki and Tatsuya Kimura, are stunned by Ippo's powerful punches—a result of strong muscles developed through years serving his physically taxing family business. \n\nFollowing brief training under Takamura, Ippo impresses the other boxers in a practice match against prodigy Ichirou Miyata. He gains a rival in Miyata and a coach in Genji Kamogawa, the gym owner and a former boxer himself. As Ippo takes the first steps in his official boxing career, he faces off against a series of challenging opponents, each more powerful than the last. Victory, loss, and a cycle of dedicated training await Ippo on his journey to achieve greatness. With his tough body and unstoppable fighting spirit, the kind young man seeks to take on the world.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/86334.webp?s=8268694dfd75895e71475e096b2bbef6",
            "type": "TV"
        },
        {
            "_id": "199",
            "title": "Sen to Chihiro no Kamikakushi",
            "alternativeTitles": [
                "Sen and Chihiro's Spiriting Away",
                "千と千尋の神隠し",
                "Spirited Away",
                "Chihiros Reise ins Zauberland",
                "El viaje de Chihiro",
                "Le Voyage de Chihiro"
            ],
            "ranking": 40,
            "genres": [
                "Adventure",
                "Award Winning",
                "Supernatural"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/6/79597.webp",
            "link": "https://myanimelist.net/anime/199/Sen_to_Chihiro_no_Kamikakushi",
            "status": "Finished Airing",
            "synopsis": "Stubborn, spoiled, and naïve, 10-year-old Chihiro Ogino is less than pleased when she and her parents discover an abandoned amusement park on the way to their new house. Cautiously venturing inside, she realizes that there is more to this place than meets the eye, as strange things begin to happen once dusk falls. Ghostly apparitions and food that turns her parents into pigs are just the start—Chihiro has unwittingly crossed over into the spirit world. Now trapped, she must summon the courage to live and work amongst spirits, with the help of the enigmatic Haku and the cast of unique characters she meets along the way.\n\nVivid and intriguing, Sen to Chihiro no Kamikakushi tells the story of Chihiro's journey through an unfamiliar world as she strives to save her parents and return home.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/79597.webp?s=a67e3ef6bdeb66c04331e766ce29b44d",
            "type": "Movie"
        },
        {
            "_id": "52198",
            "title": "Kaguya-sama wa Kokurasetai: First Kiss wa Owaranai",
            "alternativeTitles": [
                "かぐや様は告らせたい -ファーストキッスは終わらない-",
                "Kaguya-sama: Love is War - The First Kiss That Never Ends"
            ],
            "ranking": 41,
            "genres": [
                "Comedy",
                "Drama",
                "Romance"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1670/130060.webp",
            "link": "https://myanimelist.net/anime/52198/Kaguya-sama_wa_Kokurasetai__First_Kiss_wa_Owaranai",
            "status": "Finished Airing",
            "synopsis": "After their first kiss, Kaguya Shinomiya and Miyuki Shirogane are left unsure where their relationship stands. The troubling uncertainty of whether they could be considered an official couple unleashes newfound problems as both Kaguya and Shirogane struggle to sort out their feelings.\n\nWhile the lovestruck student council officers fret, the Christmas season rolls around, and romance is in the air. In the face of widespread tenderness, Kaguya and Shirogane must endure their affectionate battle of wits once more. Should they reconcile their feelings for one another, they may find themselves within reach of what they have both been longing for so long: true love.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1670/130060.webp?s=9f198bb58c3b007ff9adbcb5ffef978e",
            "type": "Movie"
        },
        {
            "_id": "17074",
            "title": "Monogatari Series: Second Season",
            "alternativeTitles": [
                "Nekomonogatari: Shiro",
                "Kabukimonogatari",
                "Otorimonogatari",
                "Onimonogatari",
                "Koimonogatari",
                "〈物語〉シリーズ セカンドシーズン",
                "Monogatari Series: Second Season",
                "Monogatari Seconde Saison"
            ],
            "ranking": 42,
            "genres": [
                "Comedy",
                "Mystery",
                "Romance",
                "Supernatural"
            ],
            "episodes": 26,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1807/121534.webp",
            "link": "https://myanimelist.net/anime/17074/Monogatari_Series__Second_Season",
            "status": "Finished Airing",
            "synopsis": "Apparitions, oddities, and gods continue to manifest around Koyomi Araragi and his close-knit group of friends: Tsubasa Hanekawa, the group's modest genius; Shinobu Oshino, the resident doughnut-loving vampire; athletic deviant Suruga Kanbaru; bite-happy spirit Mayoi Hachikuji; Koyomi's cutesy stalker Nadeko Sengoku; and Hitagi Senjougahara, Koyomi's aloof classmate.\n\nMonogatari Series: Second Season revolves around these individuals and their struggle to overcome the darkness that is rapidly approaching. A new semester has begun and with graduation looming over Koyomi, he must quickly decide the paths he will walk, as well as the relationships and friends that he'll save. But as strange events begin to unfold, Koyomi is nowhere to be found, and a vicious tiger apparition has appeared in his absence. Hanekawa has become its target, and she must fend for herself—or bow to the creature's perspective on the feebleness of humanity.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1807/121534.webp?s=779acb3712ad15ac22ecd34eb31a20f8",
            "type": "TV"
        },
        {
            "_id": "48583",
            "title": "Shingeki no Kyojin: The Final Season Part 2",
            "alternativeTitles": [
                "Shingeki no Kyojin Season 4",
                "Attack on Titan Season 4",
                "進撃の巨人 The Final Season Part 2",
                "Attack on Titan: Final Season Part 2"
            ],
            "ranking": 43,
            "genres": [
                "Action",
                "Drama"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1948/120625.webp",
            "link": "https://myanimelist.net/anime/48583/Shingeki_no_Kyojin__The_Final_Season_Part_2",
            "status": "Finished Airing",
            "synopsis": "Turning against his former allies and enemies alike, Eren Yeager sets a disastrous plan in motion. Under the guidance of the Beast Titan, Zeke, Eren takes extreme measures to end the ancient conflict between Marley and Eldia—but his true intentions remain a mystery. Delving deep into his family's past, Eren fights to control his own destiny.\n\nMeanwhile, the long-feuding nations of Marley and Eldia utilize both soldiers and Titans in a brutal race to eliminate the other. Reiner Braun uses his own powers in a desperate bid to hold off Eren's own militaristic force, and his fellow Eldians—children Falco Grice and Gabi Braun—struggle to survive in the unfolding chaos.\n\nElsewhere, Eren's childhood friends Mikasa Ackerman and Armin Arlert remain imprisoned alongside Eren's former Survey Corps companions, all disturbed by Eren's monstrous transformation. Under the blind belief that Eren still secretly harbors good intentions, Mikasa and the others enter the fray in an attempt to save their friend's very soul.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1948/120625.webp?s=2cd8bf5c3db4989c2040dda3ce707a10",
            "type": "TV"
        },
        {
            "_id": "37521",
            "title": "Vinland Saga",
            "alternativeTitles": [
                "ヴィンランド・サガ"
            ],
            "ranking": 44,
            "genres": [
                "Action",
                "Adventure",
                "Drama"
            ],
            "episodes": 24,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1500/103005.webp",
            "link": "https://myanimelist.net/anime/37521/Vinland_Saga",
            "status": "Finished Airing",
            "synopsis": "Young Thorfinn grew up listening to the stories of old sailors that had traveled the ocean and reached the place of legend, Vinland. It's said to be warm and fertile, a place where there would be no need for fighting—not at all like the frozen village in Iceland where he was born, and certainly not like his current life as a mercenary. War is his home now. Though his father once told him, \"You have no enemies, nobody does. There is nobody who it's okay to hurt,\" as he grew, Thorfinn knew that nothing was further from the truth.\n\nThe war between England and the Danes grows worse with each passing year. Death has become commonplace, and the viking mercenaries are loving every moment of it. Allying with either side will cause a massive swing in the balance of power, and the vikings are happy to make names for themselves and take any spoils they earn along the way. Among the chaos, Thorfinn must take his revenge and kill Askeladd, the man who murdered his father. The only paradise for the vikings, it seems, is the era of war and death that rages on.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1500/103005.webp?s=f7b0f457364275ef2453a1b7f45bea1d",
            "type": "TV"
        },
        {
            "_id": "45649",
            "title": "The First Slam Dunk",
            "alternativeTitles": [
                "THE FIRST SLAM DUNK"
            ],
            "ranking": 45,
            "genres": [
                "Award Winning",
                "Sports"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1745/129284.webp",
            "link": "https://myanimelist.net/anime/45649/The_First_Slam_Dunk",
            "status": "Finished Airing",
            "synopsis": "Shohoku's \"speedster\" and point guard, Ryouta Miyagi, always plays with brains and lightning speed, running circles around his opponents while feigning composure. Born and raised in Okinawa, Ryouta had a brother who was three years older. Following in the footsteps of his older brother, who was a famous local player from a young age, Ryouta also became addicted to basketball.\n\nIn his second year of high school, Ryouta plays with the Shohoku High School basketball team along with Sakuragi, Rukawa, Akagi, and Mitsui as they take the stage at the Inter-High School National Championship. And now, they are on the brink of challenging the reigning champions, Sannoh Kogyo High School.\n\n(Source: GKIDS, edited)",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1745/129284.webp?s=8869fc323a524f44ac89eb05f1354845",
            "type": "Movie"
        },
        {
            "_id": "1",
            "title": "Cowboy Bebop",
            "alternativeTitles": [
                "カウボーイビバップ",
                "Cowboy Bebop"
            ],
            "ranking": 46,
            "genres": [
                "Action",
                "Award Winning",
                "Sci-Fi"
            ],
            "episodes": 26,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/4/19644.webp",
            "link": "https://myanimelist.net/anime/1/Cowboy_Bebop",
            "status": "Finished Airing",
            "synopsis": "Crime is timeless. By the year 2071, humanity has expanded across the galaxy, filling the surface of other planets with settlements like those on Earth. These new societies are plagued by murder, drug use, and theft, and intergalactic outlaws are hunted by a growing number of tough bounty hunters.\n\nSpike Spiegel and Jet Black pursue criminals throughout space to make a humble living. Beneath his goofy and aloof demeanor, Spike is haunted by the weight of his violent past. Meanwhile, Jet manages his own troubled memories while taking care of Spike and the Bebop, their ship. The duo is joined by the beautiful con artist Faye Valentine, odd child Edward Wong Hau Pepelu Tivrusky IV, and Ein, a bioengineered Welsh Corgi.\n\nWhile developing bonds and working to catch a colorful cast of criminals, the Bebop crew's lives are disrupted by a menace from Spike's past. As a rival's maniacal plot continues to unravel, Spike must choose between life with his newfound family or revenge for his old wounds.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/19644.webp?s=7701780d5a9b45e3c371a724b05a2422",
            "type": "TV"
        },
        {
            "_id": "39894",
            "title": "Hibike! Euphonium 3",
            "alternativeTitles": [
                "Hibike! Euphonium Third Season",
                "Hibike! Euphonium 3",
                "響け！ユーフォニアム3",
                "Sound! Euphonium 3"
            ],
            "ranking": 47,
            "genres": [],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1216/142086.webp",
            "link": "https://myanimelist.net/anime/39894/Hibike_Euphonium_3",
            "status": "Not yet aired",
            "synopsis": "After the Kitauji High School Wind Ensemble pulls a stunning performance in Oumae Kumiko's first year, their results in her second year feel underwhelming to the entire club. They intended to achieve a gold medal at the national competition, but their participation ends with what is known as a \"dud gold\" at the Kansai competition: a gold medal that does not include being chosen to advance to the national competition. With the end of the cycle, the ensemble's seniors retire, and a new leadership takes charge; Kumiko, soon to be a senior herself, is appointed the new club president. Now it is up to her to, under the guidance of their teacher Taki Noboru, shoulder Kitauji to the Nationals once again and help the band achieve the gold medal they have been aiming for.\n\n(Source: AniDB)",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1216/142086.webp?s=5869712a85cc876ebb8fd116b280ebfd",
            "type": "TV"
        },
        {
            "_id": "47778",
            "title": "Kimetsu no Yaiba: Yuukaku-hen",
            "alternativeTitles": [
                "鬼滅の刃 遊郭編",
                "Demon Slayer: Kimetsu no Yaiba Entertainment District Arc"
            ],
            "ranking": 48,
            "genres": [
                "Action",
                "Fantasy"
            ],
            "episodes": 11,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1908/120036.webp",
            "link": "https://myanimelist.net/anime/47778/Kimetsu_no_Yaiba__Yuukaku-hen",
            "status": "Finished Airing",
            "synopsis": "The devastation of the Mugen Train incident still weighs heavily on the members of the Demon Slayer Corps. Despite being given time to recover, life must go on, as the wicked never sleep: a vicious demon is terrorizing the alluring women of the Yoshiwara Entertainment District. The Sound Pillar, Tengen Uzui, and his three wives are on the case. However, when he soon loses contact with his spouses, Tengen fears the worst and enlists the help of Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira to infiltrate the district's most prominent houses and locate the depraved Upper Rank demon.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1908/120036.webp?s=6c3f12619ae34223b00c8181a31d6b86",
            "type": "TV"
        },
        {
            "_id": "50160",
            "title": "Kingdom 4th Season",
            "alternativeTitles": [
                "キングダム 第4シリーズ",
                "Kingdom: Season 4"
            ],
            "ranking": 49,
            "genres": [],
            "episodes": 26,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1566/122794.webp",
            "link": "https://myanimelist.net/anime/50160/Kingdom_4th_Season",
            "status": "Finished Airing",
            "synopsis": "Following the conclusion of the large-scale coalition campaign, the entirety of China is in a state of economic recovery. The victor of the battle, the state of Qin, is no different. There, the political parties led by Ying Zheng and Buwei Lü continue their inner conflict. Having played the role of king in the coalition battle, Zheng has the trust of the people—but Lü is far from out of the fight. In 18 months, he plans to interrupt Zheng's coming-of-age ceremony.\n\nMeanwhile, a Zhao army numbering 20,000 troops has set out toward Qin. In the royal court, due to the lack of generals capable of responding to the incoming threat, Lü slyly suggests that Zheng take command. However, Cheng Jiao, Zheng's half-brother, volunteers instead. As they grew to trust each other during the coalition battle, Zheng now accepts Jiao as his replacement.\n\nHowever, the Zhao forces retreat a mere half-day after clashing with Jiao's army. With trouble quickly brewing in the shadows, the internal struggle of Qin is only complicated further. There are only two men Zheng feels he can rely on: Bi, a general who commands 30,000 men; and Xin, the leader of the Fei Xin force.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1566/122794.webp?s=99612de5bceb32a1784e9e4801a29ea9",
            "type": "TV"
        },
        {
            "_id": "53223",
            "title": "Kingdom 5th Season",
            "alternativeTitles": [
                "キングダム 第5シリーズ",
                "Kingdom Season 5"
            ],
            "ranking": 50,
            "genres": [],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1050/139641.webp",
            "link": "https://myanimelist.net/anime/53223/Kingdom_5th_Season",
            "status": "Not yet aired",
            "synopsis": "Fifth season of Kingdom",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1050/139641.webp?s=7dce605d76664e5be503505520e6a43e",
            "type": "TV"
        },
        {
            "_id": "2921",
            "title": "Ashita no Joe 2",
            "alternativeTitles": [
                "Rocky Joe 2",
                "あしたのジョー２",
                "Tomorrow's Joe 2",
                "N/A",
                "El Campeón/ El mañana de Joe 2"
            ],
            "ranking": 51,
            "genres": [
                "Drama",
                "Sports"
            ],
            "episodes": 47,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/3/45028.webp",
            "link": "https://myanimelist.net/anime/2921/Ashita_no_Joe_2",
            "status": "Finished Airing",
            "synopsis": "Yabuki Joe is left downhearted and hopeless after a certain tragic event. In attempt to put the past behind him, Joe leaves the gym behind and begins wandering. On his travels he comes across the likes of Wolf Kanagushi and Goromaki Gondo, men who unintentionally fan the dying embers inside him, leading him to putting his wanderings to an end. His return home puts Joe back on the path to boxing, but unknown to himself and his trainer, he now suffers deep-set issues holding him back from fighting. In attempt to quell those issues, Carlos Rivera, a world renowned boxer is invited from Venezuela to help Joe recover.",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/45028.webp?s=7e46677a06eafcea04fb74b99f277ab8",
            "type": "TV"
        },
        {
            "_id": "44074",
            "title": "Shiguang Dailiren",
            "alternativeTitles": [
                "Shi Guang Dai Li Ren",
                "时光代理人",
                "Link Click"
            ],
            "ranking": 52,
            "genres": [
                "Drama",
                "Supernatural"
            ],
            "episodes": 11,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1135/114867.webp",
            "link": "https://myanimelist.net/anime/44074/Shiguang_Dailiren",
            "status": "Finished Airing",
            "synopsis": "It is said that a picture is worth a thousand words. In this case, it holds an infinite amount of secrets. These are secrets that only Cheng Xiaoshi and Lu Guang are able to find. In a small shop called \"Time Photo Studio,\" the two friends provide a special service: using their extraordinary powers that let them enter photographs, they jump into pictures brought to them by clients in order to grant their wishes. Through the eyes of the photographer, they live through the events surrounding the picture and try to decipher how to solve their client's request.\n\nBut every time they jump into a picture, they take a great risk. One wrong move and they could alter the future of the person who took the picture... and possibly countless other events too. So when the events they are forced to live through in these pictures start to become personal, it will take the utmost strength to push their feelings aside and focus on accomplishing the task they were paid to do.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1135/114867.webp?s=7365b681b1f6c2cadca69452ae541e0a",
            "type": "ONA"
        },
        {
            "_id": "58125",
            "title": "Look Back",
            "alternativeTitles": [
                "ルックバック"
            ],
            "ranking": 53,
            "genres": [],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1716/142633.webp",
            "link": "https://myanimelist.net/anime/58125/Look_Back",
            "status": "Not yet aired",
            "synopsis": "Fourth-grader Ayumu Fujino regularly draws four-panel manga for her school newspaper and is lauded as having the best artwork in her class. One day, she is asked by her teacher to turn over one of her manga slots in the school newspaper to a truant student named Kyomoto. When Kyomoto's manga pops up alongside Fujino's, it receives high praises for its detailed artwork, making Fujino furiously jealous.\n\nRefusing to be beaten by someone who barely attends school, Fujino devotes herself to learning to create manga. As time goes on though, her goal of outshining Kyomoto seems to only get further and further away, and Fujino, now in sixth grade, eventually gives up and quits making manga.\n\nGraduation day arrives, and Fujino is asked to deliver Kyomoto's graduation certificate to her. Through chance, the two end up coming face to face, and their unexpected meeting will end up having consequences far beyond what either of them could ever predict.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1716/142633.webp?s=73252e807eead4dc0d2ee96995c28469",
            "type": "Movie"
        },
        {
            "_id": "24701",
            "title": "Mushishi Zoku Shou 2nd Season",
            "alternativeTitles": [
                "Mushishi Zoku Shou 2nd Season",
                "蟲師 続章",
                "Mushi-shi: Next Passage Part 2"
            ],
            "ranking": 54,
            "genres": [
                "Adventure",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "episodes": 10,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/9/68095.webp",
            "link": "https://myanimelist.net/anime/24701/Mushishi_Zoku_Shou_2nd_Season",
            "status": "Finished Airing",
            "synopsis": "Ghostly, primordial beings known as Mushi continue to cause mysterious changes in the lives of humans. The travelling Mushishi, Ginko, persists in trying to set right the strange and unsettling situations he encounters. Time loops, living shadows, and telepathy are among the overt effects of interference from Mushi, but more subtle symptoms that take years to be noticed also rouse Ginko's concern as he passes from village to village.\n\nThrough circumstance, Ginko has become an arbiter, determining which Mushi are blessings and which are curses. But the lines that he seeks to draw are subjective. Some of his patients would rather exercise their new powers until they are utterly consumed by them; others desperately strive to rid themselves of afflictions which are in fact protecting their lives from devastation. Those who cross paths with Mushi must learn to accept seemingly impossible consequences for their actions, and heal wounds they did not know they had. Otherwise, they risk meeting with fates beyond their comprehension.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/9/68095.webp?s=a10a6a2f4534171b2adb470a0eac6fe3",
            "type": "TV"
        },
        {
            "_id": "21",
            "title": "One Piece",
            "alternativeTitles": [
                "OP",
                "ONE PIECE",
                "One Piece"
            ],
            "ranking": 55,
            "genres": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1244/138851.webp",
            "link": "https://myanimelist.net/anime/21/One_Piece",
            "status": "Currently Airing",
            "synopsis": "Gol D. Roger was known as the \"Pirate King,\" the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King.\n\nEnter Monkey D. Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece.\n\n[Written by MAL Rewrite] ",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1244/138851.webp?s=3e80d4f7ce8770aad4bf9293a0c0e571",
            "type": "TV"
        },
        {
            "_id": "50172",
            "title": "Mob Psycho 100 III",
            "alternativeTitles": [
                "Mob Psycho 100 3rd Season",
                "Mob Psycho Hyaku",
                "Mob Psycho One Hundred",
                "モブサイコ100 III",
                "Mob Psycho 100 III"
            ],
            "ranking": 56,
            "genres": [
                "Action",
                "Comedy",
                "Supernatural"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1228/125011.webp",
            "link": "https://myanimelist.net/anime/50172/Mob_Psycho_100_III",
            "status": "Finished Airing",
            "synopsis": "After foiling a world-threatening plot, Shigeo \"Mob\" Kageyama returns to tackle the more exhausting aspects of his mundane life—starting with filling out his school's nerve-racking career form. Meanwhile, he continues to assist his mentor Arataka Reigen and the office's new recruit, Katsuya Serizawa, in solving paranormal cases of their clients. While continuing his duties, Mob also works on gaining more independence in his esper and human lives, as well as trying to integrate better with the people around him.\n\nHowever, new supernatural and ordinary challenges test Mob’s emotional stability and force him to confront the realities around him. As he strives to continue forward on the path to maturity, Mob must resolve his emotional crises and reassess the naivety he has held on for so long.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1228/125011.webp?s=c5de059da0740caacc80202eddc20485",
            "type": "TV"
        },
        {
            "_id": "33095",
            "title": "Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen",
            "alternativeTitles": [
                "Shouwa Genroku Rakugo Shinjuu 2nd Season",
                "Showa and Genroku Era Lover's Suicide Through Rakugo 2nd Season",
                "昭和元禄落語心中～助六再び篇～",
                "Descending Stories: Showa Genroku Rakugo Shinju",
                "Le Rakugo ou la Vie 2"
            ],
            "ranking": 57,
            "genres": [],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1493/124765.webp",
            "link": "https://myanimelist.net/anime/33095/Shouwa_Genroku_Rakugo_Shinjuu__Sukeroku_Futatabi-hen",
            "status": "Finished Airing",
            "synopsis": "Even after having risen to the utmost rank of shin'uchi, Yotarou struggles to find his own identity in the world of rakugo. Caught between his master's teachings and the late Sukeroku's unique style, his performance lacks an important ingredient—ego. And while his popularity packs the theaters, he is but one of the few; rakugo is under threat of being eclipsed.\n\nMeanwhile Yakumo, regarded by many as the last bastion of preserving the popularity of rakugo, struggles to cope with his elderly state. Even though his performances are still stellar, he fears that he is nearing his limits. His doubts grow stronger as an old friend creeps ever closer. Konatsu, for her part, attempts to raise her son as a single mother, which Yotarou is heavily opposed to. Instead, he seeks to persuade her to marry him and in turn raise her son as his own.\n\nIn Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen, the curtains fall on Yotarou and Yakumo's story, tasked with restoring the near-obsolete art form as well as overcoming their internal conflicts.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1493/124765.webp?s=663a20eefef04502e802c5f0aa5d3f52",
            "type": "TV"
        },
        {
            "_id": "48569",
            "title": "86 Part 2",
            "alternativeTitles": [
                "86―エイティシックス―",
                "86 Eighty-Six Part 2"
            ],
            "ranking": 58,
            "genres": [
                "Action",
                "Drama",
                "Sci-Fi"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1321/117508.webp",
            "link": "https://myanimelist.net/anime/48569/86_Part_2",
            "status": "Finished Airing",
            "synopsis": "The disappearance of the Spearhead Squadron beyond the horizon does little to hide the intensity of the Republic of San Magnolia's endless propaganda. Vladilena Milizé continues to operate as \"Handler One,\" the commander of yet another dehumanized 86th faction's squadron in the continuous war against the Legion.\n\nOn the Western Front, Shinei Nouzen and his squad are quarantined in a military base controlled by the Federal Republic of Giad, formerly known as the Giadian Empire. The newly-established government grants the saved Eighty-Six full citizenship and freedom. Housed by the president Ernst Zimmerman himself, the group meets his adoptive daughter and the last Empress, Augusta Frederica Adel-Adler.\n\nHowever, within the calm of this tender society, Shinei and his team feel that their purpose is on the battlefield. Before long, they are once again in the midst of the Legion's onslaught as a part of the Federacy's Nordlicht Squadron, accompanied by Augusta Frederica. But, as history repeats itself, they realize that no matter the side, death and pain on the front lines are the only comfort they know.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1321/117508.webp?s=8d75fefb3ba6d5719cc6cd559bb3e367",
            "type": "TV"
        },
        {
            "_id": "1575",
            "title": "Code Geass: Hangyaku no Lelouch",
            "alternativeTitles": [
                "コードギアス 反逆のルルーシュ",
                "Code Geass: Lelouch of the Rebellion",
                "Code Geass: Lelouch of the Rebellion",
                "Code Geass: Lelouch",
                "el de la Rebelión",
                "Code Geass: Lelouch of the Rebellion"
            ],
            "ranking": 59,
            "genres": [
                "Action",
                "Award Winning",
                "Drama",
                "Sci-Fi"
            ],
            "episodes": 25,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1032/135088.webp",
            "link": "https://myanimelist.net/anime/1575/Code_Geass__Hangyaku_no_Lelouch",
            "status": "Finished Airing",
            "synopsis": "In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence.\n\nLelouch Lamperouge, a Britannian student, unfortunately finds himself caught in a crossfire between the Britannian and the Area 11 rebel armed forces. He is able to escape, however, thanks to the timely appearance of a mysterious girl named C.C., who bestows upon him Geass, the \"Power of Kings.\" Realizing the vast potential of his newfound \"power of absolute obedience,\" Lelouch embarks upon a perilous journey as the masked vigilante known as Zero, leading a merciless onslaught against Britannia in order to get revenge once and for all.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1032/135088.webp?s=38b62743c7d6a4b07fcd2a49d0e28a13",
            "type": "TV"
        },
        {
            "_id": "44",
            "title": "Rurouni Kenshin: Meiji Kenkaku Romantan - Tsuioku-hen",
            "alternativeTitles": [
                "Rurouni Kenshin: Tsuiokuhen",
                "Rurouni Kenshin: Reminiscence",
                "るろうに剣心―明治剣客浪漫譚―追憶編",
                "Samurai X: Trust and Betrayal",
                "Rurouni Kenshin Trust and Betrayal",
                "Kenshin: El Guerrero Samurai  \"Recuerdos\"",
                "Kenshin Le Vagabond: Le Chapitre de la Mémoire"
            ],
            "ranking": 60,
            "genres": [
                "Action",
                "Drama",
                "Romance"
            ],
            "episodes": 4,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1656/137618.webp",
            "link": "https://myanimelist.net/anime/44/Rurouni_Kenshin__Meiji_Kenkaku_Romantan_-_Tsuioku-hen",
            "status": "Finished Airing",
            "synopsis": "When mankind's savagery surpasses his fear of death, there is little hope for those who wish to live honest lives. Beneath a full moon, a young boy witnesses the murder of the bandits who had enslaved him, and is then christened with a new name by the man who rescued him. This boy is Shinta, now known as Kenshin Himura, and he is destined to become a swordsman. The softness of his heart does not befit the occupation, but his desire to protect the innocent is absolute.\n\nRurouni Kenshin: Meiji Kenkaku Romantan - Tsuioku-hen details the origins of the man who would bear the name of Hitokiri Battousai long before he swore his oath not to kill and before he earned his reputation as an assassin. The young man's heart is divided between justice and corruption, while the fate of a nation rests on his actions.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1656/137618.webp?s=b735b4129276a27e685ad47eb6250b58",
            "type": "OVA"
        },
        {
            "_id": "21939",
            "title": "Mushishi Zoku Shou",
            "alternativeTitles": [
                "Mushi-shi Zoku Shou",
                "Mushishi: The Next Chapter",
                "蟲師 続章",
                "Mushi-shi: Next Passage Part 1",
                "Mushi-Shi -The Next Passage-",
                "Mushi-Shi -The Next Passage-",
                "Mushishi Zoku Shô"
            ],
            "ranking": 61,
            "genres": [
                "Adventure",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "episodes": 10,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/13/58533.webp",
            "link": "https://myanimelist.net/anime/21939/Mushishi_Zoku_Shou",
            "status": "Finished Airing",
            "synopsis": "Perceived as strange and feared by man, over time the misshapen ones came to be known as Mushi. Although they harbor no ill intentions towards humans, many suffer from the side effects of their existence and strange nature; exploiting the Mushi without understanding them, even unintentionally, can lead to disaster and strife for any involved. Mushishi Zoku Shou continues the story of Mushishi Ginko on his journey to help the visible world to coexist with the Mushi.\n\nDuring his travels, Ginko discovers various gifted individuals—those cursed by circumstance and those maintaining a fragile symbiosis with the Mushi—inevitably confronting the question of whether humanity, talented and tortured alike, can manage the responsibility of the unseen. Moreover, as a Mushishi, Ginko must learn more about these strange beings and decide if he has the right to interfere with the complex relationships between Mushi and mankind.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/13/58533.webp?s=c2b07344edbe80e4e8b97c8c93db15cf",
            "type": "TV"
        },
        {
            "_id": "53998",
            "title": "Bleach: Sennen Kessen-hen - Ketsubetsu-tan",
            "alternativeTitles": [
                "Bleach: Thousand-Year Blood War Arc",
                "BLEACH 千年血戦篇-訣別譚-",
                "Bleach: Thousand-Year Blood War - The Separation"
            ],
            "ranking": 62,
            "genres": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1164/138058.webp",
            "link": "https://myanimelist.net/anime/53998/Bleach__Sennen_Kessen-hen_-_Ketsubetsu-tan",
            "status": "Not yet aired",
            "synopsis": "Second cour of Bleach: Sennen Kessen-hen.",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1164/138058.webp?s=e07ca27d8be69c429e5d86aa142512d1",
            "type": "TV"
        },
        {
            "_id": "245",
            "title": "Great Teacher Onizuka",
            "alternativeTitles": [
                "GTO",
                "GTO - The Animation",
                "グレート・ティーチャー・オニヅカ",
                "Great Teacher Onizuka"
            ],
            "ranking": 63,
            "genres": [],
            "episodes": 43,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/13/11460.webp",
            "link": "https://myanimelist.net/anime/245/Great_Teacher_Onizuka",
            "status": "Finished Airing",
            "synopsis": "Twenty-two-year-old Eikichi Onizuka—ex-biker gang leader, conqueror of Shonan, and virgin—has a dream: to become the greatest high school teacher in all of Japan. This isn't because of a passion for teaching, but because he wants a loving teenage wife when he's old and gray. Still, for a perverted, greedy, and lazy delinquent, there is more to Onizuka than meets the eye. So when he lands a job as the homeroom teacher of the Class 3-4 at the prestigious Holy Forest Academy—despite suplexing the Vice Principal—all of his talents are put to the test, as this class is particularly infamous.\n\nDue to their utter contempt for all teachers, the class' students use psychological warfare to mentally break any new homeroom teacher they get, forcing them to quit and leave school. However, Onizuka isn't your average teacher, and he's ready for any challenge in his way.\n\nBullying, suicide, and sexual harassment are just a few of the issues his students face daily. By tackling the roots of their problems, Onizuka supports them with his unpredictable and unconventional methods—even if it means jumping off a building to save a suicidal child. Thanks to his eccentric charm and fun-loving nature, Class 3-4 slowly learns just how enjoyable school can be when you're the pupils of the Great Teacher Onizuka.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/13/11460.webp?s=f64e54fcab27355d3f6dd549651f0bd1",
            "type": "TV"
        },
        {
            "_id": "40434",
            "title": "Mo Dao Zu Shi: Wanjie Pian",
            "alternativeTitles": [
                "Grandmaster of Demonic Cultivation 3",
                "The Founder of Diabolism 3",
                "Mo Dao Zu Shi 3rd Season",
                "Mo Dao Zu Shi Final Arc",
                "魔道祖师 完结篇",
                "The Founder of Diabolism Season 3"
            ],
            "ranking": 64,
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy",
                "Mystery"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1634/116782.webp",
            "link": "https://myanimelist.net/anime/40434/Mo_Dao_Zu_Shi__Wanjie_Pian",
            "status": "Finished Airing",
            "synopsis": "Along an empty road in the rural countryside, Wei Wuxian and Lan Wangji stumble across a stone plaque that reads \"Yi City.\" Still on their quest to unravel the mystery behind the cursed severed arm, they venture into the deserted city to obtain further leads.\n\nHowever, with the appearance of a mysterious new cultivator, the demonic arm investigation leads Wei Wuxian and Lan Wangji to a plot that threatens the cultivation world as they know it. The gravity of the new situation escalates when the two find it involves the chief cultivator of the renowned Lanling Jin Sect—Jin Guangyao.\n\nAs the pair continue to piece together the crucial conspiracies of the cultivation history, their friends and colleagues grow suspicious of their motives. With the world against him, Wei Wuxian must prove he is not the demonic sorcerer people believe him to be to regain their trust and save the cultivation world from the sinister evil lurking within it.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1634/116782.webp?s=ffa387cf69a385ac3c0200cb9ab78b97",
            "type": "ONA"
        },
        {
            "_id": "33352",
            "title": "Violet Evergarden",
            "alternativeTitles": [
                "ヴァイオレット・エヴァーガーデン",
                "Violet Evergarden"
            ],
            "ranking": 65,
            "genres": [
                "Drama",
                "Fantasy"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1795/95088.webp",
            "link": "https://myanimelist.net/anime/33352/Violet_Evergarden",
            "status": "Finished Airing",
            "synopsis": "The Great War finally came to an end after four long years of conflict; fractured in two, the continent of Telesis slowly began to flourish once again. Caught up in the bloodshed was Violet Evergarden, a young girl raised for the sole purpose of decimating enemy lines. Hospitalized and maimed in a bloody skirmish during the War's final leg, she was left with only words from the person she held dearest, but with no understanding of their meaning.\n\nRecovering from her wounds, Violet starts a new life working at CH Postal Services after a falling out with her new intended guardian family. There, she witnesses by pure chance the work of an \"Auto Memory Doll,\" amanuenses that transcribe people's thoughts and feelings into words on paper. Moved by the notion, Violet begins work as an Auto Memory Doll, a trade that will take her on an adventure, one that will reshape the lives of her clients and hopefully lead to self-discovery.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1795/95088.webp?s=8812880f34a53e7e9ecd9111801a04e6",
            "type": "TV"
        },
        {
            "_id": "50399",
            "title": "Tian Guan Cifu Er",
            "alternativeTitles": [
                "天官赐福 第二季",
                "Heaven Official's Blessing"
            ],
            "ranking": 66,
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy",
                "Supernatural"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1203/139210.webp",
            "link": "https://myanimelist.net/anime/50399/Tian_Guan_Cifu_Er",
            "status": "Not yet aired",
            "synopsis": "Second season of Tian Guan Ci Fu.",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1203/139210.webp?s=0fd3509dca6b7674cc0476dafbd8a256",
            "type": "ONA"
        },
        {
            "_id": "5258",
            "title": "Hajime no Ippo: New Challenger",
            "alternativeTitles": [
                "Hajime no Ippo New Series",
                "Hajime no Ippo Season II",
                "Hajime no Ippo 2",
                "はじめの一歩 新シリーズ",
                "Fighting Spirit: New Challenger",
                "Hajime no Ippo: The Fighting. New Challenger"
            ],
            "ranking": 67,
            "genres": [],
            "episodes": 26,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/8/56617.webp",
            "link": "https://myanimelist.net/anime/5258/Hajime_no_Ippo__New_Challenger",
            "status": "Finished Airing",
            "synopsis": "Japanese Featherweight Champion Ippo Makunouchi has successfully defended and retained his title. Meanwhile, his rival, Ichirou Miyata, has resurfaced in Japan, aiming for his own Featherweight belt in the Oriental Pacific Boxing Federation. When the rest of the world comes knocking, however, will Japan's best fighters rise to the challenge and achieve glory at the top? Or will the small island nation be crushed under the weight of greater entities? This time, champions will become challengers issuing a call to the rest of the world and ready to show off their fighting spirit!\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/8/56617.webp?s=afbd0cfc0f31c4ff2210bb5cc9cec03c",
            "type": "TV"
        },
        {
            "_id": "431",
            "title": "Howl no Ugoku Shiro",
            "alternativeTitles": [
                "ハウルの動く城",
                "Howl's Moving Castle",
                "Das wandelnde Schloss",
                "El Castillo Ambulante",
                "Le Château ambulant"
            ],
            "ranking": 68,
            "genres": [
                "Adventure",
                "Award Winning",
                "Drama",
                "Fantasy",
                "Romance"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1470/138723.webp",
            "link": "https://myanimelist.net/anime/431/Howl_no_Ugoku_Shiro",
            "status": "Finished Airing",
            "synopsis": "That jumbled piece of architecture, that cacophony of hissing steam and creaking joints, with smoke billowing from it as it moves on its own... That castle is home to the magnificent wizard Howl, infamous for both his magical prowess and for being a womanizer—or so the rumor goes in Sophie Hatter's small town. Sophie, as the plain daughter of a hatmaker, does not expect much from her future and is content with working hard in the shop. \n\nHowever, Sophie's simple life takes a turn for the exciting when she is ensnared in a disturbing situation, and the mysterious wizard appears to rescue her. Unfortunately, this encounter, brief as it may be, spurs the vain and vengeful Witch of the Waste—in a fit of jealousy caused by a past discord with Howl—to put a curse on the maiden, turning her into an old woman.\n\nIn an endeavor to return to normal, Sophie must accompany Howl and a myriad of eccentric companions—ranging from a powerful fire demon to a hopping scarecrow—in his living castle, on a dangerous adventure as a raging war tears their kingdom apart.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1470/138723.webp?s=765f0518ddbfe2f7a38b215ba117d3ab",
            "type": "Movie"
        },
        {
            "_id": "52742",
            "title": "Haikyuu!! Movie: Gomisuteba no Kessen",
            "alternativeTitles": [
                "ハイキュー!! FINAL",
                "Haikyu!! Final"
            ],
            "ranking": 69,
            "genres": [],
            "episodes": 2,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1665/140360.webp",
            "link": "https://myanimelist.net/anime/52742/Haikyuu_Movie__Gomisuteba_no_Kessen",
            "status": "Not yet aired",
            "synopsis": "Sequel movies to Haikyuu!! To the Top.",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1665/140360.webp?s=da1a87af25d8a1305da6dd252d5d7330",
            "type": "Movie"
        },
        {
            "_id": "164",
            "title": "Mononoke Hime",
            "alternativeTitles": [
                "Mononoke Hime",
                "もののけ姫",
                "Princess Mononoke",
                "Prinzessin Mononoke",
                "La Princesa Mononoke",
                "Princesse Mononoké"
            ],
            "ranking": 70,
            "genres": [
                "Action",
                "Adventure",
                "Award Winning",
                "Fantasy"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/7/75919.webp",
            "link": "https://myanimelist.net/anime/164/Mononoke_Hime",
            "status": "Finished Airing",
            "synopsis": "When an Emishi village is attacked by a fierce demon boar, the young prince Ashitaka puts his life at stake to defend his tribe. With its dying breath, the beast curses the prince's arm, granting him demonic powers while gradually siphoning his life away. Instructed by the village elders to travel westward for a cure, Ashitaka arrives at Tatara, the Iron Town, where he finds himself embroiled in a fierce conflict: Lady Eboshi of Tatara, promoting constant deforestation, stands against Princess San and the sacred spirits of the forest, who are furious at the destruction brought by the humans. As the opposing forces of nature and mankind begin to clash in a desperate struggle for survival, Ashitaka attempts to seek harmony between the two, all the while battling the latent demon inside of him. Princess Mononoke is a tale depicting the connection of technology and nature, while showing the path to harmony that could be achieved by mutual acceptance.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/7/75919.webp?s=2521ede81b391f67db013a3384e4ee44",
            "type": "Movie"
        },
        {
            "_id": "45576",
            "title": "Mushoku Tensei: Isekai Ittara Honki Dasu Part 2",
            "alternativeTitles": [
                "無職転生 ～異世界行ったら本気だす～ 第2クール",
                "Mushoku Tensei: Jobless Reincarnation Part 2"
            ],
            "ranking": 71,
            "genres": [
                "Drama",
                "Fantasy",
                "Ecchi"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1028/117777.webp",
            "link": "https://myanimelist.net/anime/45576/Mushoku_Tensei__Isekai_Ittara_Honki_Dasu_Part_2",
            "status": "Finished Airing",
            "synopsis": "After the mysterious mana calamity, Rudeus Greyrat and his fierce student Eris Boreas Greyrat are teleported to the Demon Continent. There, they team up with their newfound companion Ruijerd Supardia—the former leader of the Superd's Warrior group—to form \"Dead End,\" a successful adventurer party. Making a name for themselves, the trio journeys across the continent to make their way back home to Fittoa.\n\nFollowing the advice he received from the faceless god Hitogami, Rudeus saves Kishirika Kishirisu, the Great Emperor of the Demon World, who rewards him by granting him a strange power. Now, as Rudeus masters the powerful ability that offers a number of new opportunities, it might prove to be more than what he bargained for when unexpected dangers threaten to hinder their travels.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1028/117777.webp?s=e85e0841254e47d280933ad0a3533304",
            "type": "TV"
        },
        {
            "_id": "46102",
            "title": "Odd Taxi",
            "alternativeTitles": [
                "オッドタクシー",
                "Odd Taxi"
            ],
            "ranking": 72,
            "genres": [
                "Award Winning",
                "Mystery"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1981/113348.webp",
            "link": "https://myanimelist.net/anime/46102/Odd_Taxi",
            "status": "Finished Airing",
            "synopsis": "Eccentric and blunt, the walrus Hiroshi Odokawa lives a relatively normal life. He drives a taxi for a living, and there he meets several unique individuals: the jobless Taichi Kabasawa who is dead-set on going viral, the mysterious nurse Miho Shirakawa, the struggling comedic duo \"Homo Sapiens,\" and Dobu, a well-known delinquent.\n\nBut Odokawa's simple way of life is about to be turned upside down. The case of a missing girl the police have been tracking leads back to him, and now both the yakuza and a duo of corrupt cops are on his tail.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1981/113348.webp?s=ebc819a4e14f25c83eb3b5bae897ccb6",
            "type": "TV"
        },
        {
            "_id": "457",
            "title": "Mushishi",
            "alternativeTitles": [
                "蟲師",
                "Mushi-Shi",
                "Mushi-Shi",
                "Mushi-Shi",
                "Mushi-Shi"
            ],
            "ranking": 73,
            "genres": [
                "Adventure",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "episodes": 26,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/2/73862.webp",
            "link": "https://myanimelist.net/anime/457/Mushishi",
            "status": "Finished Airing",
            "synopsis": "\"Mushi\": the most basic forms of life in the world. They exist without any goals or purposes aside from simply \"being.\" They are beyond the shackles of the words \"good\" and \"evil.\" Mushi can exist in countless forms and are capable of mimicking things from the natural world such as plants, diseases, and even phenomena like rainbows.\n\nThis is, however, just a vague definition of these entities that inhabit the vibrant world of Mushishi, as to even call them a form of life would be an oversimplification. Detailed information on Mushi is scarce because the majority of humans are unaware of their existence.\n\nSo what are Mushi and why do they exist? This is the question that a \"Mushishi,\" Ginko, ponders constantly. Mushishi are those who research Mushi in hopes of understanding their place in the world's hierarchy of life.\n\nGinko chases rumors of occurrences that could be tied to Mushi, all for the sake of finding an answer.\n\nIt could, after all, lead to the meaning of life itself.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/2/73862.webp?s=e7daa40d51986da2bf4dcd3bbcf5bf0f",
            "type": "TV"
        },
        {
            "_id": "33050",
            "title": "Fate/stay night Movie: Heaven's Feel - III. Spring Song",
            "alternativeTitles": [
                "Fate/stay night Movie: Heaven's Feel 3",
                "劇場版「Fate/stay night [Heaven's Feel] III.spring song」",
                "Fate/stay night: Heaven's Feel - III. Spring Song",
                "Fate/stay night: Heaven's Feel - III. Spring Song"
            ],
            "ranking": 74,
            "genres": [
                "Action",
                "Fantasy",
                "Supernatural"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1142/112957.webp",
            "link": "https://myanimelist.net/anime/33050/Fate_stay_night_Movie__Heavens_Feel_-_III_Spring_Song",
            "status": "Finished Airing",
            "synopsis": "The Fifth Holy Grail War in Fuyuki City has reached a turning point in which the lives of all participants are threatened as the hidden enemy finally reveals itself. As Shirou Emiya, Rin Toosaka, and Illyasviel von Einzbern discover the true, corruptive nature of the shadow that has been rampaging throughout the city, they realize just how dire the situation is. In order to protect their beloved ones, the group must hold their own against the seemingly insurmountable enemy force—even if some of those foes were once their allies, or perhaps, something more intimate.\n\nAs the final act of this chaotic war commences, the ideals Shirou believes will soon be challenged by an excruciating dilemma: is it really possible to save a world where everything seems to have gone wrong?\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1142/112957.webp?s=dff8c1aedf0492600bee7d7df84a19cd",
            "type": "Movie"
        },
        {
            "_id": "54898",
            "title": "Bungou Stray Dogs 5th Season",
            "alternativeTitles": [
                "文豪ストレイドッグス",
                "Bungo Stray Dogs 5"
            ],
            "ranking": 75,
            "genres": [
                "Action",
                "Mystery",
                "Supernatural"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1161/136691.webp",
            "link": "https://myanimelist.net/anime/54898/Bungou_Stray_Dogs_5th_Season",
            "status": "Not yet aired",
            "synopsis": "Fifth Season of Bungou Stray Dogs",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1161/136691.webp?s=a29529ee479b46b2f11adc115791a98c",
            "type": "TV"
        },
        {
            "_id": "23273",
            "title": "Shigatsu wa Kimi no Uso",
            "alternativeTitles": [
                "Kimiuso",
                "四月は君の嘘",
                "Your Lie in April",
                "Shigatsu Wa Kimi No Uso - Sekunden in Moll",
                "Your Lie in April",
                "Your Lie in April"
            ],
            "ranking": 76,
            "genres": [
                "Drama",
                "Romance"
            ],
            "episodes": 22,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1405/143284.webp",
            "link": "https://myanimelist.net/anime/23273/Shigatsu_wa_Kimi_no_Uso",
            "status": "Finished Airing",
            "synopsis": "Kousei Arima is a child prodigy known as the \"Human Metronome\" for playing the piano with precision and perfection. Guided by a strict mother and rigorous training, Kousei dominates every competition he enters, earning the admiration of his musical peers and praise from audiences. When his mother suddenly passes away, the subsequent trauma makes him unable to hear the sound of a piano, and he never takes the stage thereafter.\n\nNowadays, Kousei lives a quiet and unassuming life as a junior high school student alongside his friends Tsubaki Sawabe and Ryouta Watari. While struggling to get over his mother's death, he continues to cling to music. His monochrome life turns upside down the day he encounters the eccentric violinist Kaori Miyazono, who thrusts him back into the spotlight as her accompanist. Through a little lie, these two young musicians grow closer together as Kaori tries to fill Kousei's world with color.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1405/143284.webp?s=6730cafa2a37037d5f5f1ea17be1b2a6",
            "type": "TV"
        },
        {
            "_id": "34599",
            "title": "Made in Abyss",
            "alternativeTitles": [
                "メイドインアビス",
                "Made in Abyss"
            ],
            "ranking": 77,
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy",
                "Mystery",
                "Sci-Fi"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/6/86733.webp",
            "link": "https://myanimelist.net/anime/34599/Made_in_Abyss",
            "status": "Finished Airing",
            "synopsis": "The Abyss—a gaping chasm stretching down into the depths of the earth, filled with mysterious creatures and relics from a time long past. How did it come to be? What lies at the bottom? Countless brave individuals, known as Divers, have sought to solve these mysteries of the Abyss, fearlessly descending into its darkest realms. The best and bravest of the Divers, the White Whistles, are hailed as legends by those who remain on the surface.\n\nRiko, daughter of the missing White Whistle Lyza the Annihilator, aspires to become like her mother and explore the furthest reaches of the Abyss. However, just a novice Red Whistle herself, she is only permitted to roam its most upper layer. Even so, Riko has a chance encounter with a mysterious robot with the appearance of an ordinary young boy. She comes to name him Reg, and he has no recollection of the events preceding his discovery. Certain that the technology to create Reg must come from deep within the Abyss, the two decide to venture forth into the chasm to recover his memories and see the bottom of the great pit with their own eyes. However, they know not of the harsh reality that is the true existence of the Abyss.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/86733.webp?s=c1575349ad04d3be6ac12502f46db721",
            "type": "TV"
        },
        {
            "_id": "11665",
            "title": "Natsume Yuujinchou Shi",
            "alternativeTitles": [
                "Natsume Yuujinchou Four",
                "Natsume Yuujinchou 4",
                "Natsume Yujincho 4",
                "夏目友人帳 肆",
                "Natsume's Book of Friends Season 4",
                "Natsume Yujin-cho Staffel 4",
                "Natsume Yujin-cho Temporada 4",
                "Natsume Yujin-cho Saison 4"
            ],
            "ranking": 78,
            "genres": [
                "Drama",
                "Slice of Life",
                "Supernatural"
            ],
            "episodes": 13,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/3/37449.webp",
            "link": "https://myanimelist.net/anime/11665/Natsume_Yuujinchou_Shi",
            "status": "Finished Airing",
            "synopsis": "Takashi Natsume, the timid youkai expert and master of the Book of Friends, continues his journey towards self-understanding and acceptance with the help of friends both new and old. His most important ally is still his gluttonous and sake-loving bodyguard, the arrogant but fiercely protective wolf spirit Madara—or Nyanko-sensei, as Madara is called when in his usual disguise of an unassuming, pudgy cat.\n\nNatsume, while briefly separated from Nyanko-sensei, is ambushed and kidnapped by a strange group of masked, monkey-like youkai, who have spirited him away to their forest as they desperately search for the Book of Friends. Realizing that his \"servant\" has been taken out from right under his nose, Nyanko-sensei enlists the help of Natsume's youkai friends and mounts a rescue operation. However, the forest of the monkey spirits holds many dangerous enemies, including the Matoba Clan, Natsume's old nemesis.\n\nStretching from the formidable hideout of the Matoba to Natsume's own childhood home, Natsume Yuujinchou Shi is a sweeping but familiar return to a world of danger and friendship, where Natsume will finally confront the demons of his own past.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/37449.webp?s=8f1dfb041b14077edc1e43641be71678",
            "type": "TV"
        },
        {
            "_id": "40591",
            "title": "Kaguya-sama wa Kokurasetai? Tensai-tachi no Renai Zunousen",
            "alternativeTitles": [
                "Kaguya Wants to be Confessed To: The Geniuses' War of Love and Brains 2nd Season",
                "Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen 2nd Season",
                "Kaguya-sama: Love is War 2nd Season",
                "かぐや様は告らせたい？～天才たちの恋愛頭脳戦～",
                "Kaguya-sama: Love is War Season 2",
                "Kaguya-sama: Love Is War Staffel 2",
                "Kaguya-sama: Love Is War? Temporada 2",
                "Kaguya-sama: Love is War Saison 2"
            ],
            "ranking": 79,
            "genres": [],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1764/106659.webp",
            "link": "https://myanimelist.net/anime/40591/Kaguya-sama_wa_Kokurasetai_Tensai-tachi_no_Renai_Zunousen",
            "status": "Finished Airing",
            "synopsis": "After a slow but eventful summer vacation, Shuchiin Academy's second term is now starting in full force. As August transitions into September, Miyuki Shirogane's birthday looms ever closer, leaving Kaguya Shinomiya in a serious predicament as to how to celebrate it. Furthermore, the tenure of the school's 67th student council is coming to an end. Due to the council members being in different classes, the only time Kaguya and Miyuki have to be together will soon disappear, putting all of their cunning plans at risk.\n\nA long and difficult election that will decide the fate of the new student council awaits, as multiple challengers fight for the coveted title of president.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1764/106659.webp?s=212272d1fba3b486e97f8b1842178f59",
            "type": "TV"
        },
        {
            "_id": "49413",
            "title": "Shiguang Dailiren II",
            "alternativeTitles": [
                "Link Click 2nd Season",
                "时光代理人 第二季",
                "Link Click Season 2"
            ],
            "ranking": 80,
            "genres": [
                "Drama",
                "Supernatural"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1897/137108.webp",
            "link": "https://myanimelist.net/anime/49413/Shiguang_Dailiren_II",
            "status": "Not yet aired",
            "synopsis": "Second season of Shiguang Dailiren.",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1897/137108.webp?s=42ef05e7273806b554858eb148188afe",
            "type": "ONA"
        },
        {
            "_id": "35760",
            "title": "Shingeki no Kyojin Season 3",
            "alternativeTitles": [
                "進撃の巨人 Season3",
                "Attack on Titan Season 3",
                "Attack on Titan 3. Staffel",
                "Ataque a los Titanes Temporada 3",
                "L'Attaque des Titans Saison 3"
            ],
            "ranking": 81,
            "genres": [
                "Action",
                "Drama"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1173/92110.webp",
            "link": "https://myanimelist.net/anime/35760/Shingeki_no_Kyojin_Season_3",
            "status": "Finished Airing",
            "synopsis": "Still threatened by the \"Titans\" that rob them of their freedom, mankind remains caged inside the two remaining walls. Efforts to eradicate these monsters continue; however, threats arise not only from the Titans beyond the walls, but from the humans within them as well.\n\nAfter being rescued from the Colossal and Armored Titans, Eren Yaeger devotes himself to improving his Titan form. Krista Lenz struggles to accept the loss of her friend, Captain Levi chooses Eren and his friends to form his new personal squad, and Commander Erwin Smith recovers from his injuries. All seems well for the soldiers, until the government suddenly demands custody of Eren and Krista. The Survey Corps' recent successes have drawn attention, and a familiar face from Levi's past is sent to collect the wanted soldiers. Sought after by the government, Levi and his new squad must evade their adversaries in hopes of keeping Eren and Krista safe.\n\nEren and his fellow soldiers are not only fighting for their survival against the terrifying Titans, but also against the terror of a far more conniving foe: their fellow humans.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1173/92110.webp?s=aaead88622c543a86ca26b7e1bbc297f",
            "type": "TV"
        },
        {
            "_id": "2001",
            "title": "Tengen Toppa Gurren Lagann",
            "alternativeTitles": [
                "Tengen Toppa Gurren-Lagann",
                "Making Break-Through Gurren Lagann",
                "Heavenly Breakthrough Gurren Lagann",
                "TTGL",
                "Gurren Laggan",
                "天元突破グレンラガン",
                "Gurren Lagann",
                "Gurren Lagann",
                "Gurren Lagann",
                "Gurren Lagann"
            ],
            "ranking": 82,
            "genres": [
                "Action",
                "Adventure",
                "Award Winning",
                "Sci-Fi"
            ],
            "episodes": 27,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/4/5123.webp",
            "link": "https://myanimelist.net/anime/2001/Tengen_Toppa_Gurren_Lagann",
            "status": "Finished Airing",
            "synopsis": "Simon and Kamina were born and raised in a deep, underground village, hidden from the fabled surface. Kamina is a free-spirited loose cannon bent on making a name for himself, while Simon is a timid young boy with no real aspirations. One day while excavating the earth, Simon stumbles upon a mysterious object that turns out to be the ignition key to an ancient artifact of war, which the duo dubs Lagann. Using their new weapon, Simon and Kamina fend off a surprise attack from the surface with the help of Yoko Littner, a hot-blooded redhead wielding a massive gun who wanders the world above.\n\nIn the aftermath of the battle, the sky is now in plain view, prompting Simon and Kamina to set off on a journey alongside Yoko to explore the wastelands of the surface. Soon, they join the fight against the \"Beastmen,\" humanoid creatures that terrorize the remnants of humanity in powerful robots called \"Gunmen.\" Although they face some challenges and setbacks, the trio bravely fights these new enemies alongside other survivors to reclaim the surface, while slowly unraveling a galaxy-sized mystery.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/5123.webp?s=c34cacc696bd3dff67177eda401e75fb",
            "type": "TV"
        },
        {
            "_id": "52034",
            "title": "\"Oshi no Ko\"",
            "alternativeTitles": [
                "My Star",
                "【推しの子】",
                "[Oshi No Ko]"
            ],
            "ranking": 83,
            "genres": [
                "Drama",
                "Supernatural"
            ],
            "episodes": 11,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1812/134736.webp",
            "link": "https://myanimelist.net/anime/52034/Oshi_no_Ko",
            "status": "Finished Airing",
            "synopsis": "In the entertainment world, celebrities often show exaggerated versions of themselves to the public, concealing their true thoughts and struggles beneath elaborate lies. Fans buy into these fabrications, showering their idols with undying love and support, until something breaks the illusion. Sixteen-year-old rising star Ai Hoshino of pop idol group B Komachi has the world captivated; however, when she announces a hiatus due to health concerns, the news causes many to become worried.\n\nAs a huge fan of Ai, gynecologist Gorou Amemiya cheers her on from his countryside medical practice, wishing he could meet her in person one day. His wish comes true when Ai shows up at his hospital—not sick, but pregnant with twins! While the doctor promises Ai to safely deliver her children, he wonders if this encounter with the idol will forever change the nature of his relationship with her.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1812/134736.webp?s=8714c83b1b5d0c432eb80ec607925fb2",
            "type": "TV"
        },
        {
            "_id": "1535",
            "title": "Death Note",
            "alternativeTitles": [
                "DN",
                "デスノート",
                "Death Note"
            ],
            "ranking": 84,
            "genres": [
                "Supernatural",
                "Suspense"
            ],
            "episodes": 37,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1079/138100.webp",
            "link": "https://myanimelist.net/anime/1535/Death_Note",
            "status": "Finished Airing",
            "synopsis": "Brutal murders, petty thefts, and senseless violence pollute the human world. In contrast, the realm of death gods is a humdrum, unchanging gambling den. The ingenious 17-year-old Japanese student Light Yagami and sadistic god of death Ryuk share one belief: their worlds are rotten.\n\nFor his own amusement, Ryuk drops his Death Note into the human world. Light stumbles upon it, deeming the first of its rules ridiculous: the human whose name is written in this note shall die. However, the temptation is too great, and Light experiments by writing a felon's name, which disturbingly enacts his first murder.\n\nAware of the terrifying godlike power that has fallen into his hands, Light—under the alias Kira—follows his wicked sense of justice with the ultimate goal of cleansing the world of all evil-doers. The meticulous mastermind detective L is already on his trail, but as Light's brilliance rivals L's, the grand chase for Kira turns into an intense battle of wits that can only end when one of them is dead.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1079/138100.webp?s=da1890dd3581df570127fbd3d31d6898",
            "type": "TV"
        },
        {
            "_id": "28891",
            "title": "Haikyuu!! Second Season",
            "alternativeTitles": [
                "Haikyuu!! Second Season",
                "ハイキュー!! セカンドシーズン",
                "Haikyu!! 2nd Season",
                "Haikyu!! Staffel 2",
                "Haikyu!! Los Ases del Vóley Temporada 2",
                "Haikyu!! Saison 2"
            ],
            "ranking": 85,
            "genres": [],
            "episodes": 25,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/9/76662.webp",
            "link": "https://myanimelist.net/anime/28891/Haikyuu_Second_Season",
            "status": "Finished Airing",
            "synopsis": "Following their participation at the Inter-High, the Karasuno High School volleyball team attempts to refocus their efforts, aiming to conquer the Spring tournament instead. \n\nWhen they receive an invitation from long-standing rival Nekoma High, Karasuno agrees to take part in a large training camp alongside many notable volleyball teams in Tokyo and even some national level players. By playing with some of the toughest teams in Japan, they hope not only to sharpen their skills, but also come up with new attacks that would strengthen them. Moreover, Hinata and Kageyama attempt to devise a more powerful weapon, one that could possibly break the sturdiest of blocks. \n\nFacing what may be their last chance at victory before the senior players graduate, the members of Karasuno's volleyball team must learn to settle their differences and train harder than ever if they hope to overcome formidable opponents old and new—including their archrival Aoba Jousai and its world-class setter Tooru Oikawa.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/9/76662.webp?s=be0d03c826724f9d6f682223685669c2",
            "type": "TV"
        },
        {
            "_id": "41084",
            "title": "Made in Abyss: Retsujitsu no Ougonkyou",
            "alternativeTitles": [
                "メイドインアビス 烈日の黄金郷",
                "Made in Abyss: The Golden City of the Scorching Sun"
            ],
            "ranking": 86,
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy",
                "Mystery",
                "Sci-Fi"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1864/122519.webp",
            "link": "https://myanimelist.net/anime/41084/Made_in_Abyss__Retsujitsu_no_Ougonkyou",
            "status": "Finished Airing",
            "synopsis": "After surviving the brutal challenges of Idofront, Riko now possesses a White Whistle, allowing her to descend into the Abyss's sixth layer—The Capital of the Unreturned. Alongside Reg and Nanachi, Riko begins to explore the uncharted domain, where the ruins of the promised Golden City are located.\n\nAs the trio starts to adapt to the harsh environment, they soon encounter dangerous creatures and treacherous landscapes. Their expedition leads them to a village inhabited by strange beings known as \"hollows.\" Despite the creeping sense of unease that welcomes them, the three venture onward to uncover the mysteries of the settlement and long-lost legacies of the forgotten adventurers who once descended into the horrors of the unexplored Abyss.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1864/122519.webp?s=9b9ae44544ffba2a8e112c0b44b0b67d",
            "type": "TV"
        },
        {
            "_id": "22135",
            "title": "Ping Pong the Animation",
            "alternativeTitles": [
                "PPTA",
                "ピンポン THE ANIMATION",
                "Ping Pong the Animation"
            ],
            "ranking": 87,
            "genres": [
                "Award Winning",
                "Drama",
                "Sports"
            ],
            "episodes": 11,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/10/58041.webp",
            "link": "https://myanimelist.net/anime/22135/Ping_Pong_the_Animation",
            "status": "Finished Airing",
            "synopsis": "Despite being polar opposites, Makoto \"Smile\" Tsukimoto and Yutaka \"Peco\" Hoshino have been best friends since childhood. Although the overly confident Peco strives to be the best ping-pong player in the world, he often skips practice, earning the ire of his fellow teammates on the Katase High School ping-pong team. Meanwhile, Smile—in spite of his innate talent for the sport—cannot help but hold back his full strength when playing against others. Through their mutual love for ping-pong, the two have developed a bond that is seemingly unbreakable.\n\nWhen Peco hears that an ex-national team player from China is coming to Japan, he drags Smile over to rival Tsujido High School to observe them. The subsequent trip leads to a clash between Peco and Kong Wenge, who overwhelmingly defeats the former in one game. Stunned by such a comprehensive loss, Peco finds himself questioning why he plays to begin with. Seeing his potential as a player, Katase's coach begins to train Smile to overcome his hesitation, but he is reluctant to play if it is not for enjoyment.\n\nAs the two struggle to find meaning in the sport, a plethora of stronger players—each with their own internal strifes—await them at the inter-high tournament, where only the very best can persevere. But when these young athletes let their unbridled ambition go unchecked, the hardships they face paint a somber reality as they pursue glory.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/58041.webp?s=aa798e29b979f3de977b4ad342d70b45",
            "type": "TV"
        },
        {
            "_id": "36862",
            "title": "Made in Abyss Movie 3: Fukaki Tamashii no Reimei",
            "alternativeTitles": [
                "Gekijouban Made in Abyss: Fukaki Tamashii no Reimei",
                "Made in Abyss: Dawn of the Deep Soul",
                "劇場版メイドインアビス 深き魂の黎明",
                "Made in Abyss: Dawn of the Deep Soul",
                "Made in Abyss: Seelen der Finsternis",
                "Made in Abyss : L'Aurore de L’Âme des Profondeurs"
            ],
            "ranking": 88,
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy",
                "Mystery",
                "Sci-Fi"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1502/110723.webp",
            "link": "https://myanimelist.net/anime/36862/Made_in_Abyss_Movie_3__Fukaki_Tamashii_no_Reimei",
            "status": "Finished Airing",
            "synopsis": "After bonding over a tragic loss, the long-suffering Nanachi joins Riko and Reg on their journey into the depths of the Abyss. Awaiting the children is the Sea of Corpses—the Abyss's fifth layer, and the deepest level from which a traveler can return without losing their human form.\n\nThe masked sadist Bondrewd stands between the children and the rest of their adventure. Bondrewd's horrific laboratory serves as a final checkpoint for those wishing to traverse deeper into the Abyss, and the sociopathic scientist has no desire to allow Riko's party to pass through at no cost. Deeply scarred by Bondrewd's impact on their childhood, Nanachi is engulfed in turmoil over his resurgence in their life.\n\nBondrewd's only apparent weakness is Prushka, a brash child who claims to be his daughter. Riko, Reg, and Nanachi befriend Prushka and work with the girl to overcome her father's machinations and breach the Abyss's sixth layer.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1502/110723.webp?s=0e73de5f3b62a2e52a775311c349770f",
            "type": "Movie"
        },
        {
            "_id": "34591",
            "title": "Natsume Yuujinchou Roku",
            "alternativeTitles": [
                "Natsume Yuujinchou Season 6",
                "Natsume's Book of Friends Six",
                "夏目友人帳 陸",
                "Natsume's Book of Friends Season 6",
                "Natsume Yujin-cho 6",
                "Natsume Yujin-cho 6",
                "Natsume Yujin-cho 6"
            ],
            "ranking": 89,
            "genres": [
                "Drama",
                "Slice of Life",
                "Supernatural"
            ],
            "episodes": 11,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/6/84416.webp",
            "link": "https://myanimelist.net/anime/34591/Natsume_Yuujinchou_Roku",
            "status": "Finished Airing",
            "synopsis": "Takashi Natsume has grown accustomed to his encounters with youkai through the Book of Friends, which contains the names of youkai whom his grandmother, Reiko Natsume, has sealed in contracts. These encounters allow Natsume to better understand the youkai, Reiko, and himself. \n\nThe Book of Friends is a powerful tool that can be used to control youkai; it is sought after by both youkai and exorcists alike. Natsume just wants to live out his daily life in peace but is constantly disrupted by these experiences. If he is to end this torment, Natsume must explore more about the book and the world of exorcism, as well as begin to open his heart to those who can help him.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/84416.webp?s=f6d8df2f681695b08f51ef25ffcfa3f1",
            "type": "TV"
        },
        {
            "_id": "52701",
            "title": "Dungeon Meshi",
            "alternativeTitles": [
                "Dungeon Food",
                "ダンジョン飯",
                "Delicious in Dungeon"
            ],
            "ranking": 90,
            "genres": [
                "Comedy",
                "Fantasy",
                "Gourmet"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1711/142478.webp",
            "link": "https://myanimelist.net/anime/52701/Dungeon_Meshi",
            "status": "Not yet aired",
            "synopsis": "After the Golden Kingdom is sunk underground by an insane magician, its king emerges, promising all of his treasure to any who defeat the magician, before crumbling to dust. Guilds are spurred on by this promise, traversing the labyrinthine dungeon in search of the magician. Laios, the leader of one such guild, encounters a dragon that wipes out his party and devours his sister Falin. Despite having lost the entirety of their supplies and belongings, Laios along with Marcille, an elven healer, and Chilchuck, a halfling thief, immediately reenter the dungeon, determined to save Falin.\n\nTime being of the essence, Laios suggests the taboo of eating the monsters of the dungeon as a means of gathering supplies. Upon the preparation of their first meal in the dungeon, they are stopped by an onlooking dwarf named Senshi. An enthusiast of monster cooking, he helps them prepare their monster ingredients for safe consumption. After learning of Laios' circumstances, Senshi expresses his desire to cook a dragon and joins their guild, thus beginning their food-filled foray into the dungeon together. \n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1711/142478.webp?s=005904691af4039d1d0a4ea6b682dba0",
            "type": "TV"
        },
        {
            "_id": "42310",
            "title": "Cyberpunk: Edgerunners",
            "alternativeTitles": [
                "CYBERPUNK: EDGERUNNERS"
            ],
            "ranking": 91,
            "genres": [
                "Action",
                "Sci-Fi"
            ],
            "episodes": 10,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1818/126435.webp",
            "link": "https://myanimelist.net/anime/42310/Cyberpunk__Edgerunners",
            "status": "Finished Airing",
            "synopsis": "Dreams are doomed to die in Night City, a futuristic Californian metropolis. As a teenager living in the city's slums, David Martinez is trying to fulfill his mother's lifelong wish for him to reach the top of Arasaka, the world's leading security corporation. To this end, he attends the prestigious Arasaka Academy while his mother works tirelessly to keep their family afloat.\n\nWhen an incident with a street gang leaves David's life in tatters, he stumbles upon Sandevistan cyberware—a prosthetic that grants its wearer superhuman speed. Fueled by rage, David implants the device in his back, using it to exact revenge on one of his tormentors. This gets him expelled from the academy, shattering his hopes of ever making his mother proud.\n\nAfter witnessing David's newfound abilities, the beautiful data thief Lucyna \"Lucy\" Kushinada offers to team up with him, handing him a ticket to salvation. However, associating with Lucy introduces David to the world of Edgerunners—cyborg criminals who will break any law for money. Edgerunners often lose their lives, if the cyberware does not break their minds first; but in his fight for survival inside a corrupt system, David is ready to risk it all.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1818/126435.webp?s=48ae5d4f68c48f764ed3565c80de32b6",
            "type": "ONA"
        },
        {
            "_id": "19647",
            "title": "Hajime no Ippo: Rising",
            "alternativeTitles": [
                "Fighting Spirit: Rising",
                "Hajime no Ippo 3",
                "はじめの一歩 Rising",
                "Hajime No Ippo: The Fighting!",
                "Hajime No Ippo: The Fighting! - Rising",
                "Hajime No Ippo: The Fighting!",
                "Hajime No Ippo: The Fighting! - Rising"
            ],
            "ranking": 92,
            "genres": [],
            "episodes": 25,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/6/56147.webp",
            "link": "https://myanimelist.net/anime/19647/Hajime_no_Ippo__Rising",
            "status": "Finished Airing",
            "synopsis": "Japanese Featherweight Champion Makunouchi Ippo has defended his title belt once more with the help of his devastating signature move: the Dempsey Roll. However, new challengers are rising up left and right, claiming to have an answer for the move responsible for crushing his opponents. Will Ippo be able to step up to the challenge, or will the weight of his pride destroy him before he finds out just what it means to be strong? Meanwhile, fellow Kamogawa Gym mate Aoki Masaru is just a hop, skip, and a Frog Punch away from claiming his own belt, ready to take on the Japanese Lightweight Champion!\n\nHajime no Ippo: Rising continues Ippo's quest to become stronger, featuring the same cast of loveable dimwits from Kamogawa Gym, as they put their bodies and hearts on the line to make their way in the harsh world of professional boxing. With a will of iron, Ippo steps into the ring once again.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/56147.webp?s=96688fd70266a761f1e90e8d3031ecae",
            "type": "TV"
        },
        {
            "_id": "7311",
            "title": "Suzumiya Haruhi no Shoushitsu",
            "alternativeTitles": [
                "The Vanishment of Haruhi Suzumiya",
                "Suzumiya Haruhi no Syoshitsu",
                "Haruhi Movie",
                "涼宮ハルヒの消失",
                "The Disappearance of Haruhi Suzumiya",
                "Das Verschwinden der Haruhi Suzumiya der Film",
                "La Disparition de Haruhi Suzumiya la Film"
            ],
            "ranking": 93,
            "genres": [
                "Award Winning",
                "Mystery",
                "Sci-Fi",
                "Supernatural"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1248/112352.webp",
            "link": "https://myanimelist.net/anime/7311/Suzumiya_Haruhi_no_Shoushitsu",
            "status": "Finished Airing",
            "synopsis": "On a cold December day, Kyon arrives at school prepared for another outing with his fellow SOS Brigade members. However, much to his surprise, he discovers that almost everything has changed completely: Haruhi Suzumiya and Itsuki Koizumi are nowhere to be found; Mikuru Asahina does not recognize him at all; Yuki Nagato is a regular human; and Ryouko Asakura has mysteriously returned. Although he is no stranger to the supernatural, Kyon is disturbed by this odd turn of events and decides to investigate on his own.\n\nFinding himself to be the only person that is aware of the previous reality, Kyon is now faced with a difficult choice: to finally live the normal life he has always wanted, or uncover a way to turn back the hands of time and restore his chaotic yet familiar world.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1248/112352.webp?s=4f285b2c806a3f3dc520739e3c5b83ad",
            "type": "Movie"
        },
        {
            "_id": "56538",
            "title": "Kimi ni Todoke 3rd Season",
            "alternativeTitles": [
                "君に届け 3RD SEASON",
                "Kimi ni Todoke: From Me to You Season 3"
            ],
            "ranking": 94,
            "genres": [
                "Drama",
                "Romance"
            ],
            "episodes": 0,
            "hasEpisode": false,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1617/142448.webp",
            "link": "https://myanimelist.net/anime/56538/Kimi_ni_Todoke_3rd_Season",
            "status": "Not yet aired",
            "synopsis": "Third season of Kimi ni Todoke.",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1617/142448.webp?s=861ce1c7ab432299b181a7b66aaea1b7",
            "type": "ONA"
        },
        {
            "_id": "40748",
            "title": "Jujutsu Kaisen",
            "alternativeTitles": [
                "Sorcery Fight",
                "JJK",
                "呪術廻戦",
                "Jujutsu Kaisen",
                "Jujutsu Kaisen",
                "Jujutsu Kaisen",
                "Jujutsu Kaisen"
            ],
            "ranking": 95,
            "genres": [
                "Action",
                "Award Winning",
                "Fantasy"
            ],
            "episodes": 24,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1171/109222.webp",
            "link": "https://myanimelist.net/anime/40748/Jujutsu_Kaisen",
            "status": "Finished Airing",
            "synopsis": "Idly indulging in baseless paranormal activities with the Occult Club, high schooler Yuuji Itadori spends his days at either the clubroom or the hospital, where he visits his bedridden grandfather. However, this leisurely lifestyle soon takes a turn for the strange when he unknowingly encounters a cursed item. Triggering a chain of supernatural occurrences, Yuuji finds himself suddenly thrust into the world of Curses—dreadful beings formed from human malice and negativity—after swallowing the said item, revealed to be a finger belonging to the demon Sukuna Ryoumen, the \"King of Curses.\"\n\nYuuji experiences first-hand the threat these Curses pose to society as he discovers his own newfound powers. Introduced to the Tokyo Metropolitan Jujutsu Technical High School, he begins to walk down a path from which he cannot return—the path of a Jujutsu sorcerer.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1171/109222.webp?s=7d6c42c9d69e13ef609900c46d8d45f5",
            "type": "TV"
        },
        {
            "_id": "33",
            "title": "Kenpuu Denki Berserk",
            "alternativeTitles": [
                "Berserk: The Chronicles of Wind Blades",
                "Sword-Wind Chronicle Berserk",
                "剣風伝奇ベルセルク",
                "Berserk",
                "Berserk",
                "Berserk",
                "Berserk"
            ],
            "ranking": 96,
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy",
                "Horror"
            ],
            "episodes": 25,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1384/119988.webp",
            "link": "https://myanimelist.net/anime/33/Kenpuu_Denki_Berserk",
            "status": "Finished Airing",
            "synopsis": "Guts, a man who will one day be known as the Black Swordsman, is a young traveling mercenary characterized by the large greatsword he carries. He accepts jobs that offer the most money, but he never stays with one group for long—until he encounters the Band of the Falcon. Ambushed after completing a job, Guts crushes many of its members in combat. Griffith, The Band of the Falcon's leader and founder, takes an interest in Guts and duels him. While the others are no match for Guts, Griffith defeats him in one blow.\n\nIncapacitated and taken into the Band of the Falcon's camp to recover, Guts wakes up two days later. He confronts Griffith, and the two duel yet again, only this time with a condition: Guts will join the Band of the Falcon if he loses. Due to his fresh injuries, Guts loses the fight and is inducted by Griffith.\n\nIn three years' time, Guts has become one of the Band of the Falcon's commanders. On the battlefield, his combat prowess is second only to Griffith as he takes on large groups of enemies all on his own. With Guts' immense strength and Griffith's leadership, the Band of the Falcon dominate every battle they partake in. But something menacing lurks in the shadows, threatening to change Guts' life forever.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1384/119988.webp?s=3e0c6ccd22fc94452bbed0e0a7938bac",
            "type": "TV"
        },
        {
            "_id": "28957",
            "title": "Mushishi Zoku Shou: Suzu no Shizuku",
            "alternativeTitles": [
                "Mushishi Tokubetsu-hen: Suzu no Shizuku",
                "Mushishi: The Next Chapter - Drops of Bells",
                "蟲師 続章: 鈴の雫"
            ],
            "ranking": 97,
            "genres": [
                "Adventure",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/9/72689.webp",
            "link": "https://myanimelist.net/anime/28957/Mushishi_Zoku_Shou__Suzu_no_Shizuku",
            "status": "Finished Airing",
            "synopsis": "On a warm summer day, a boy heard the sound of bells ringing, as if in celebration, in the mountain near his home. Several years later in that same mountain, the mushishi Ginko encounters a strange girl with weeds growing out of her body. Soon after, Ginko coincidentally runs into the now grown-up boy Yoshiro on his way off the mountain. With Yoshiro's help, Ginko soon begins to uncover who this mysterious girl is and what happened to her.\n\nAn adaptation of the last arc in the manga, Mushishi Zoku Shou: Suzu no Shizuku follows Ginko's peculiar journey amidst the occult to unravel the mystery behind the enigmatic girl called Kaya and the mountain that has become her home.\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/9/72689.webp?s=f35408f831f4bf66a4659f57734336fa",
            "type": "Movie"
        },
        {
            "_id": "38329",
            "title": "Seishun Buta Yarou wa Yumemiru Shoujo no Yume wo Minai",
            "alternativeTitles": [
                "青春ブタ野郎はゆめみる少女の夢を見ない",
                "Rascal Does Not Dream of a Dreaming Girl",
                "Rascal Does Not Dream of a Dreaming Girl",
                "Rascal Does Not Dream of a Dreaming Girl"
            ],
            "ranking": 98,
            "genres": [
                "Drama",
                "Romance",
                "Supernatural"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1613/102179.webp",
            "link": "https://myanimelist.net/anime/38329/Seishun_Buta_Yarou_wa_Yumemiru_Shoujo_no_Yume_wo_Minai",
            "status": "Finished Airing",
            "synopsis": "Six months ago, Sakuta Azusagawa had a chance encounter with a bunny girl in a library. Ever since then, he's been blissfully happy with his girlfriend: Mai Sakurajima, that same bunny girl. However, the reappearance of his mysterious first crush, the now-adult Shouko Makinohara, adds a new complication to his relationship with Mai. To make matters worse, he then encounters a middle school Shouko in the hospital, suffering from a grave illness. Mysteriously, his old scars begin throbbing whenever he's near her.\n\nWith Shouko's bizarre situation somehow revolving around him, Sakuta will need to come to terms with his own conflicting feelings, for better or worse. With a girl's life in his hands, just what can he do?\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1613/102179.webp?s=8808222aca3e96a6297ec4163f935872",
            "type": "Movie"
        },
        {
            "_id": "3786",
            "title": "Shin Evangelion Movie:||",
            "alternativeTitles": [
                "Evangelion: 4.0",
                "Rebuild of Evangelion",
                "Shin Evangelion Gekijouban: ||",
                "Rebuild of Evangelion: Final",
                "シン・エヴァンゲリオン劇場版:||",
                "Evangelion: 3.0+1.0 Thrice Upon a Time"
            ],
            "ranking": 99,
            "genres": [
                "Action",
                "Award Winning",
                "Drama",
                "Sci-Fi",
                "Suspense"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/1422/113533.webp",
            "link": "https://myanimelist.net/anime/3786/Shin_Evangelion_Movie_%7C%7C",
            "status": "Finished Airing",
            "synopsis": "Following NERV's failed attempt to retrieve the Spears of Longinus and carry out the Human Instrumentality Project, the destruction caused by the Fourth Impact has been largely averted. In a state of disarray, Shinji Ikari, Asuka Langley Shikinami, and Rei Ayanami travel to Village 3—a survivor settlement free from Earth's ruination. There, Shinji slowly comes to terms with his past, developing an entirely different life from his days as an Evangelion pilot.\n\nMeanwhile, NERV makes preparations to continue the Instrumentality Project by means of a new Impact. When WILLE's main aerial battleship arrives at the village, Shinji decides to board, believing that he can help by piloting an Evangelion. As new secrets are uncovered and a battle between WILLE and NERV approaches, the future of Earth hangs in the balance. Can Shinji save humanity and the rest of the world one last time?\n\n[Written by MAL Rewrite]",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1422/113533.webp?s=ade43b4404bff26302c7715d63cd2f38",
            "type": "Movie"
        },
        {
            "_id": "4565",
            "title": "Tengen Toppa Gurren Lagann Movie 2: Lagann-hen",
            "alternativeTitles": [
                "Tengen Toppa Gurren Lagann Movie 2",
                "劇場版 天元突破グレンラガン 螺巌篇",
                "Gurren Lagann The Movie: The Lights in the Sky are Stars",
                "Gurren Lagann Película II: Las Luces en el Cielo son Estrellas"
            ],
            "ranking": 100,
            "genres": [
                "Action",
                "Sci-Fi"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "hasRanking": true,
            "image": "https://cdn.myanimelist.net/images/anime/12/19698.webp",
            "link": "https://myanimelist.net/anime/4565/Tengen_Toppa_Gurren_Lagann_Movie_2__Lagann-hen",
            "status": "Finished Airing",
            "synopsis": "Humans have enjoyed their lavish, peaceful, and prosperous lives for seven years since the day the almighty Spiral King was defeated—the day they reclaimed their homeland, Earth. However, the boon of this lifestyle leaves them unprepared when an unknown, hostile threat arises due to the ever-growing human population. This calamity is the Anti-Spiral—a fearsome enemy with unparalleled power. \n \nAs the Spiral King's prognosis postulating the destruction of \"The Spiral's World\" begins to come true, the pieces are in place, and Team Dai-Gurren is ready. With his late brother's hope to see a better future for mankind, Simon—along with Nia Teppelin and the rest of the team—is determined to overthrow the mighty Anti-Spiral in order to revive humanity's lost hope.\n\n[Written by MAL Rewrite]\n",
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/12/19698.webp?s=81290a9fc6b48f0d6670d851307bb77e",
            "type": "Movie"
        }
    ]
}